{
    "metadata": {
        "version": "1.0",
        "last_updated": "11/28/2024",
        "language": ["ar", "en"],
        "author": " فريق رحلة",
        "description": "قاعدة بيانات شاملة لوحدات القياس العالمية والعربية"
    },
    "units": {
        "متر": {
            "english": "meter",
            "arabic": "متر",
            "description": "وحدة قياس الطول الأساسية في النظام المتري الدولي. تستخدم في قياس المسافات والأطوال في المجالات الهندسية والعلمية والحياة اليومية. يساوي المتر الواحد مسافة 100 سنتيمتر.",
            "category": "الطول",
            "examples": "- ارتفاع الباب 2 متر\n- عرض الشارع 10 متر\n- طول السيارة 4.5 متر\n- عمق البئر 15 متر",
            "Detailed_details": "المتر هو وحدة القياس الأساسية للطول في النظام الدولي للوحدات (SI). تم تعريفه رسمياً في عام 1793 كجزء من النظام المتري الفرنسي. كان تعريفه الأصلي واحد على عشرة ملايين من المسافة من خط الاستواء إلى القطب الشمالي. في عام 1983، تم إعادة تعريفه بأنه المسافة التي يقطعها الضوء في الفراغ خلال 1/299,792,458 من الثانية. يعتبر المتر أساس النظام المتري وهو مستخدم في جميع أنحاء العالم باستثناء الولايات المتحدة وبعض الدول الأخرى التي لا تزال تستخدم النظام الإمبراطوري."
        },
        "كيلومتر": {
            "english": "kilometer",
            "arabic": "كيلومتر",
            "description": "وحدة قياس المسافات الطويلة، تساوي 1000 متر. تستخدم في قياس المسافات بين المدن والمواقع الجغرافية وفي الخرائط والملاحة وقياس المسافات الطويلة على الطرق.",
            "category": "الطول",
            "examples": "- المسافة بين المدينتين 150 كيلومتر\n- طول الطريق السريع 80 كيلومتر\n- محيط الأرض عند خط الاستواء 40,075 كيلومتر",
            "Detailed_details": "الكيلومتر هو وحدة مشتقة من المتر بإضافة البادئة 'كيلو' التي تعني ألف. تم تقديمه مع النظام المتري في فرنسا عام 1799. يستخدم الكيلومتر بشكل واسع في معظم دول العالم لقياس المسافات الطويلة، خاصة في المجالات الجغرافية والنقل والمواصلات. في الولايات المتحدة، يستخدم الميل بدلاً من الكيلومتر كوحدة قياس المسافات الطويلة. الكيلومتر هو الوحدة المعيارية في الخرائط العالمية والملاحة الجوية والبحرية."
        },
        "سنتيمتر": {
            "english": "centimeter",
            "arabic": "سنتيمتر",
            "description": "وحدة قياس صغيرة تساوي جزء من مئة من المتر. تستخدم في القياسات الدقيقة والأعمال اليدوية والخياطة والنجارة وقياس أبعاد الأشياء الصغيرة.",
            "category": "الطول",
            "examples": "- طول القلم 15 سنتيمتر\n- سمك الكتاب 2 سنتيمتر\n- عرض الشريط 5 سنتيمتر",
            "Detailed_details": "السنتيمتر مشتق من المتر بإضافة البادئة 'سنتي' التي تعني جزء من مئة. تم تقديمه مع النظام المتري وهو من أكثر وحدات القياس استخداماً في الحياة اليومية. يستخدم بشكل واسع في مجالات الخياطة والنجارة والفنون والتصميم. في الطب، يستخدم لقياس نمو الأطفال وأبعاد الجسم. السنتيمتر هو وحدة مناسبة للقياسات المنزلية والمدرسية نظراً لسهولة فهمه واستخدامه."
        },
        "مليمتر": {
            "english": "millimeter",
            "arabic": "مليمتر",
            "description": "وحدة قياس دقيقة جداً تساوي جزء من ألف من المتر. تستخدم في القياسات الهندسية الدقيقة والأعمال الفنية والصناعية وصناعة الأجهزة الإلكترونية وقياس كمية الأمطار.",
            "category": "الطول",
            "examples": "- سمك الورقة 0.1 مليمتر\n- قطر السلك 2 مليمتر\n- كمية الأمطار 25 مليمتر",
            "Detailed_details": "المليمتر هو وحدة قياس دقيقة تم تقديمها مع النظام المتري. يستخدم في المجالات التي تتطلب دقة عالية مثل الهندسة الميكانيكية وصناعة الأدوات والقياسات الطبية. في الأرصاد الجوية، يستخدم المليمتر لقياس كمية هطول الأمطار. في الصناعات الدقيقة مثل صناعة الساعات والإلكترونيات، يعتبر المليمتر وحدة أساسية للقياس. يستخدم أيضاً في قياس سمك المواد مثل الزجاج والمعادن والبلاستيك."
        },
        "ميكرومتر": {
            "english": "micrometer",
            "arabic": "ميكرومتر",
            "description": "وحدة قياس صغيرة جداً تساوي جزء من مليون من المتر. تستخدم في القياسات المجهرية والصناعات الدقيقة مثل الإلكترونيات والبصريات وصناعة الرقائق الإلكترونية.",
            "category": "الطول",
            "examples": "- سمك الشعرة البشرية 100 ميكرومتر\n- أبعاد الخلية البكتيرية 2 ميكرومتر\n- سمك طبقة الطلاء 50 ميكرومتر",
            "Detailed_details": "الميكرومتر، المعروف أيضاً باسم المايكرون، هو وحدة قياس تم تقديمها في عام 1879. يرمز له بالرمز μm. يستخدم بشكل أساسي في المجالات العلمية والصناعية التي تتطلب دقة عالية جداً. في مجال البصريات، يستخدم لقياس طول موجات الضوء. في صناعة أشباه الموصلات، يعتبر الميكرومتر وحدة أساسية لقياس أبعاد المكونات الإلكترونية الدقيقة. كما يستخدم في علم الأحياء المجهري لقياس أبعاد الخلايا والكائنات المجهرية."
        },

        "نانومتر": {
            "english": "nanometer",
            "arabic": "نانومتر",
            "description": "وحدة قياس متناهية الصغر تساوي جزء من مليار من المتر. تستخدم في تكنولوجيا النانو والبحث العلمي وقياس الجزيئات والذرات وطول موجات الضوء.",
            "category": "الطول",
            "examples": "- قطر جزيء الماء 0.3 نانومتر\n- طول موجة الضوء المرئي 400-700 نانومتر\n- حجم الفيروس 100 نانومتر",
            "Detailed_details": "النانومتر هو وحدة قياس حديثة نسبياً، أصبحت مهمة مع تطور تكنولوجيا النانو في أواخر القرن العشرين. يرمز له بالرمز nm. يعتبر النانومتر أساسياً في فهم وتصنيع المواد على المستوى الذري والجزيئي. في مجال الإلكترونيات، تستخدم هذه الوحدة لقياس أبعاد الترانزستورات في المعالجات الدقيقة. في علم البصريات، تستخدم لقياس طول موجات الضوء المرئي والأشعة فوق البنفسجية. في البيولوجيا الجزيئية، تستخدم لقياس أبعاد الجزيئات البيولوجية مثل الحمض النووي والبروتينات."
        },
        "فرسخ": {
            "english": "league",
            "arabic": "فرسخ",
            "description": "وحدة قياس عربية وفارسية قديمة للمسافات الطويلة. تستخدم تاريخياً في قياس المسافات بين المدن والقرى وفي كتب التراث والجغرافيا الإسلامية.",
            "category": "الطول",
            "examples": "- المسافة بين المدينتين 10 فراسخ\n- طول الطريق التجاري 100 فرسخ\n- مسافة السفر اليومية 5 فراسخ",
            "Detailed_details": "الفرسخ وحدة قياس تاريخية يعود أصلها إلى الحضارة الفارسية القديمة. كان يعرف بأنه المسافة التي يمشيها الإنسان أو يركب فيها الحصان في ساعة واحدة. اختلف تقدير الفرسخ بين المناطق والعصور، لكنه غالباً ما كان يساوي حوالي 3 أميال أو 5.5 كيلومتر. استخدم الفرسخ بشكل واسع في العالم الإسلامي خلال العصور الوسطى، وذكر في كتب الجغرافيين والرحالة المسلمين مثل المقدسي وابن بطوطة. في بعض البلدان العربية، لا يزال الفرسخ يستخدم في التعبيرات الشعبية للدلالة على المسافات البعيدة."
        },
        "ميل": {
            "english": "mile",
            "arabic": "ميل",
            "description": "وحدة قياس المسافات في النظام الإمبراطوري والأمريكي. يستخدم في قياس المسافات الطويلة على الطرق والمسافات الجغرافية في الدول التي تستخدم النظام الإنجليزي. يساوي الميل الواحد 1.609 كيلومتر.",
            "category": "الطول",
            "examples": "- المسافة بين المدينتين 100 ميل\n- سرعة السيارة 60 ميل في الساعة\n- مسافة الجري 5 أميال",
            "Detailed_details": "الميل وحدة قياس تعود جذورها إلى الإمبراطورية الرومانية، حيث كان يعرف بـ 'ميل روماني' ويساوي ألف خطوة مزدوجة. تطور الميل عبر العصور حتى استقر على طوله الحالي (5280 قدم) في القرن السادس عشر. يستخدم الميل حالياً بشكل رئيسي في الولايات المتحدة وبريطانيا، رغم أن بريطانيا تحولت رسمياً للنظام المتري. في الملاحة البحرية، يستخدم الميل البحري الذي يختلف عن الميل البري. الميل هو الوحدة الأساسية لقياس المسافات في السيارات والطرق في الولايات المتحدة."
        },

        "ياردة": {
            "english": "yard",
            "arabic": "ياردة",
            "description": "وحدة قياس إنجليزية تساوي 3 أقدام أو 0.9144 متر. تستخدم في قياس المسافات المتوسطة، خاصة في الرياضة والنسيج والبناء في البلدان التي تستخدم النظام الإنجليزي.",
            "category": "الطول",
            "examples": "- طول ملعب كرة القدم 100 ياردة\n- عرض القماش 2 ياردة\n- مسافة الرمي 50 ياردة",
            "Detailed_details": "الياردة وحدة قياس إنجليزية قديمة يعود تاريخها إلى العصور الوسطى. يقال إن أصل الياردة كان طول حزام الملك هنري الأول من إنجلترا من أنفه إلى إصبع يده الممدودة. تم توحيد طول الياردة رسمياً في عام 1855 في بريطانيا. رغم التحول للنظام المتري، لا تزال الياردة تستخدم في بعض المجالات مثل الجولف وكرة القدم الأمريكية والنسيج. في الولايات المتحدة، الياردة هي وحدة قياس شائعة في صناعة النسيج وقياس مواد البناء."
        },

        "قدم": {
            "english": "foot",
            "arabic": "قدم",
            "description": "وحدة قياس إنجليزية تساوي 12 بوصة أو 0.3048 متر. تستخدم في قياس الارتفاعات والمسافات القصيرة، خاصة في البناء والطيران والملاحة البحرية في النظام الإنجليزي.",
            "category": "الطول",
            "examples": "- ارتفاع السقف 8 أقدام\n- عمق المسبح 6 أقدام\n- ارتفاع الطائرة 30000 قدم",
            "Detailed_details": "القدم وحدة قياس قديمة مستوحاة من طول قدم الإنسان. استخدمت في حضارات مختلفة بأطوال متفاوتة قبل أن يتم توحيدها. في عام 1959، تم تعريف القدم الدولي بدقة على أنه 0.3048 متر. يستخدم القدم بشكل واسع في الولايات المتحدة في صناعة البناء والعقارات. في مجال الطيران، يستخدم القدم عالمياً لقياس ارتفاع الطائرات. في البحرية، يستخدم لقياس عمق المياه. القدم هو أيضاً الوحدة الأساسية في قياس أبعاد مواد البناء والأثاث في الولايات المتحدة."
        },

        "بوصة": {
            "english": "inch",
            "arabic": "بوصة",
            "description": "وحدة قياس إنجليزية صغيرة تساوي 1/12 من القدم أو 2.54 سنتيمتر. تستخدم في قياس الأبعاد الصغيرة، خاصة في النجارة والإلكترونيات وقياس الشاشات.",
            "category": "الطول",
            "examples": "- حجم شاشة التلفاز 55 بوصة\n- قطر الأنبوب 2 بوصة\n- سمك اللوح 1/2 بوصة",
            "Detailed_details": "البوصة وحدة قياس إنجليزية يعود أصلها إلى العصور القديمة، حيث كانت تعادل عرض إبهام الإنسان. تم توحيد البوصة دولياً في عام 1959 لتساوي بالضبط 25.4 مليمتر. تستخدم البوصة بشكل واسع في الولايات المتحدة وبعض الدول الأخرى في مجالات متعددة. في صناعة الإلكترونيات، أصبحت البوصة معياراً عالمياً لقياس حجم الشاشات وأقراص التخزين. في النجارة والسباكة، تستخدم البوصة لقياس أبعاد المواد والأنابيب. كما تستخدم في قياس ضغط الهواء في الإطارات وقياس كمية الأمطار في بعض البلدان."
        },
        "ذراع": {
            "english": "cubit",
            "arabic": "ذراع",
            "description": "وحدة قياس عربية وإسلامية تقليدية للطول، تساوي تقريباً المسافة من المرفق إلى طرف الإصبع الوسطى. تستخدم تاريخياً في القياسات المعمارية والتجارة والفقه الإسلامي.",
            "category": "الطول",
            "examples": "- طول القماش 5 أذرع\n- ارتفاع الجدار 3 أذرع\n- عمق البئر 10 أذرع",
            "Detailed_details": "الذراع وحدة قياس قديمة استخدمت في الحضارات القديمة وخاصة في الحضارة الإسلامية. تنوعت أطوال الذراع حسب المناطق والعصور، فهناك الذراع الهاشمي والذراع البغدادي والذراع المصري. في الفقه الإسلامي، استخدم الذراع في تحديد أحكام شرعية مثل مسافة القصر في الصلاة. الذراع الشرعي يساوي تقريباً 46-48 سنتيمتر. استخدم في بناء المساجد والعمارة الإسلامية، وفي قياس الأقمشة والمواد التجارية. لا يزال يستخدم في بعض الأسواق التقليدية والحرف اليدوية في العالم العربي."
        },

        "شبر": {
            "english": "span",
            "arabic": "شبر",
            "description": "وحدة قياس عربية تقليدية تساوي المسافة بين طرف الإبهام وطرف الخنصر عند فرد الكف. تستخدم في القياسات اليدوية البسيطة والحرف التقليدية.",
            "category": "الطول",
            "examples": "- عرض اللوح شبر\n- طول القطعة شبرين\n- سمك الحائط نصف شبر",
            "Detailed_details": "الشبر وحدة قياس عربية قديمة ارتبطت بالقياسات اليومية البسيطة. يساوي الشبر تقريباً 22-25 سنتيمتر، ويختلف باختلاف حجم يد الشخص. ورد ذكر الشبر في التراث العربي والإسلامي وفي الأمثال الشعبية. استخدم في الحرف اليدوية والنجارة والخياطة التقليدية. يعتبر الشبر من أقدم وحدات القياس التي عرفها الإنسان لسهولة استخدامه وتوفره. لا يزال يستخدم في بعض المجتمعات التقليدية وفي التعبيرات اللغوية العربية."
        },

        "باع": {
            "english": "fathom",
            "arabic": "باع",
            "description": "وحدة قياس عربية تقليدية تساوي المسافة بين طرفي اليدين عند فردهما جانباً. تستخدم في قياس المسافات المتوسطة وخاصة في قياس الحبال والأقمشة.",
            "category": "الطول",
            "examples": "- طول الحبل 3 أبواع\n- عمق البئر 5 أبواع\n- عرض النهر 10 أبواع",
            "Detailed_details": "الباع وحدة قياس عربية قديمة تساوي تقريباً 1.8-2 متر. استخدم في قياس الأعماق والمسافات المتوسطة، وخاصة في الملاحة البحرية التقليدية لقياس عمق المياه. ورد ذكر الباع في كتب الفقه والتراث العربي. كان يستخدم في تجارة الأقمشة والحبال والشباك. الباع وحدة قياس طبيعية مرتبطة بجسم الإنسان، مما جعلها سهلة الاستخدام في المجتمعات التقليدية. لا يزال مصطلح الباع يستخدم في اللغة العربية مجازياً للدلالة على القدرة والامتداد."
        },
        "صاع": {
            "english": "saa",
            "arabic": "صاع",
            "description": "وحدة كيل إسلامية تقليدية تستخدم في قياس الحبوب والمواد الغذائية. له أهمية خاصة في الفقه الإسلامي لتحديد مقادير الزكاة وصدقة الفطر.",
            "category": "الحجم",
            "examples": "- زكاة الفطر صاع من تمر\n- صدقة صاع من قمح\n- كيل الأرز بالصاع",
            "Detailed_details": "الصاع وحدة قياس إسلامية أساسية يساوي أربعة أمداد. الصاع النبوي يساوي تقريباً 2.75 كيلوغرام من القمح أو 3 كيلوغرام من التمر. استخدم في عهد النبي محمد ﷺ وحدد به مقادير الزكاة والكفارات. اختلف العلماء في تقدير الصاع بالمقاييس المعاصرة، لكن المتفق عليه أنه يساوي 4 أمداد نبوية. يستخدم الصاع حتى اليوم في تحديد مقادير زكاة الفطر في العالم الإسلامي. له أهمية تاريخية وفقهية كبيرة في التراث الإسلامي."
        },
        "كيلوغرام": {
            "english": "kilogram",
            "arabic": "كيلوغرام",
            "description": "وحدة قياس الكتلة الأساسية في النظام الدولي للوحدات. يستخدم في قياس أوزان الأجسام والمواد في التجارة والصناعة والحياة اليومية. يساوي 1000 غرام.",
            "category": "الوزن",
            "examples": "- كتلة الإنسان 70 كيلوغرام\n- كتلة السيارة 1500 كيلوغرام\n- كتلة الطفل 3 كيلوغرام",
            "Detailed_details": "الكيلوغرام وحدة قياس الكتلة الأساسية في النظام المتري. يساوي 1000 غرام. استخدم في جميع المجالات العلمية والتجارية والعمليات اليومية. يستخدم في قياس الكتلة الأساسية للأجسام المادية والمواد الغذائية والمنتجات الصناعية. الكيلوغرام هو الوحدة الأساسية لقياس الكتلة في النظام المتري الدولي."
        },
        "غرام": {
            "english": "gram",
            "arabic": "غرام",
            "description": "وحدة قياس صغيرة للكتلة تساوي جزء من ألف من الكيلوغرام. تستخدم في قياس الأوزان الخفيفة مثل المواد الغذائية والمكونات الكيميائية والمجوهرات.",
            "category": "الوزن",
            "examples": "- وزن خاتم الذهب 5 غرام\n- جرعة الدواء 500 مليغرام\n- وزن التوابل 20 غرام",
            "Detailed_details": "الغرام وحدة أساسية في النظام المتري، تم تقديمه في فرنسا عام 1795. كان تعريفه الأصلي مرتبطاً بكتلة سنتيمتر مكعب من الماء النقي عند درجة حرارة معينة. يستخدم الغرام بشكل واسع في المختبرات العلمية والصيدليات وصناعة المجوهرات. في الطب، تستخدم مشتقات الغرام (مليغرام، ميكروغرام) لقياس جرعات الأدوية. في الصناعات الغذائية، يستخدم لقياس المكونات في الوصفات والمنتجات المعبأة."
        },

        "مثقال": {
            "english": "mithqal",
            "arabic": "مثقال",
            "description": "وحدة وزن إسلامية تقليدية تستخدم في قياس الذهب والفضة والمعادن النفيسة. له أهمية خاصة في تحديد نصاب الزكاة للذهب والفضة.",
            "category": "الوزن",
            "examples": "- نصاب الذهب 20 مثقال\n- وزن الخاتم 2 مثقال\n- قيمة العملة 5 مثاقيل",
            "Detailed_details": "المثقال وحدة وزن إسلامية قديمة يساوي تقريباً 4.25 غرام. استخدم في العصر الإسلامي لوزن الذهب والفضة والعملات. يرتبط المثقال بالدينار الإسلامي الذي كان يزن مثقالاً واحداً. في الفقه الإسلامي، يستخدم المثقال لتحديد نصاب زكاة الذهب (20 مثقال). لا يزال يستخدم في بعض البلدان العربية والإسلامية في تجارة الذهب والمجوهرات. المثقال له علاقة تاريخية بالدرهم الشرعي، حيث كان الدرهم يساوي 0.7 مثقال."
        },

        "درهم": {
            "english": "dirham",
            "arabic": "درهم",
            "description": "وحدة وزن إسلامية تقليدية استخدمت في وزن الفضة والمعادن. له أهمية تاريخية في النظام النقدي الإسلامي وفي تحديد أحكام الزكاة.",
            "category": "الوزن",
            "examples": "- نصاب الفضة 200 درهم\n- وزن القطعة 5 دراهم\n- قيمة المهر 100 درهم",
            "Detailed_details": "الدرهم وحدة وزن إسلامية يساوي تقريباً 2.975 غرام. كان الدرهم الشرعي يساوي 0.7 من المثقال. استخدم كعملة فضية في الدولة الإسلامية وكوحدة وزن للمعاملات التجارية. في الفقه الإسلامي، يستخدم الدرهم في تحديد نصاب زكاة الفضة (200 درهم). تطور استخدام الدرهم عبر التاريخ الإسلامي وأصبح اسماً للعملة في بعض الدول العربية المعاصرة. له أهمية تاريخية في دراسة النظام النقدي والاقتصادي الإسلامي."
        },
        "مليغرام": {
            "english": "milligram",
            "arabic": "مليغرام",
            "description": "وحدة قياس صغيرة جداً للكتلة تساوي جزء من ألف من الغرام. تستخدم في قياس الأوزان الدقيقة جداً مثل الأدوية والمواد الكيميائية والمكملات الغذائية.",
            "category": "الوزن",
            "examples": "- جرعة الدواء 500 مليغرام\n- كمية الفيتامين 100 مليغرام\n- محتوى المعادن 250 مليغرام",
            "Detailed_details": "المليغرام هو وحدة قياس دقيقة تم تقديمها مع النظام المتري. يرمز له بـ mg. يستخدم بشكل أساسي في المجال الطبي والصيدلاني لقياس جرعات الأدوية بدقة. في صناعة الأدوية، يعتبر المليغرام الوحدة القياسية لتحديد تركيز المواد الفعالة. يستخدم أيضاً في المختبرات الكيميائية والبحث العلمي لقياس كميات المواد الدقيقة. في صناعة المكملات الغذائية، يستخدم المليغرام لتحديد كميات الفيتامينات والمعادن. أهمية المليغرام تكمن في دقته العالية التي تسمح بقياس كميات صغيرة جداً من المواد."
        },

        "طن": {
            "english": "ton",
            "arabic": "طن",
            "description": "وحدة قياس كبيرة للكتلة تساوي 1000 كيلوغرام. تستخدم في قياس الأوزان الثقيلة في التجارة والصناعة والشحن البحري والبري.",
            "category": "الوزن",
            "examples": "- حمولة الشاحنة 20 طن\n- إنتاج المصنع 100 طن يومياً\n- شحنة القمح 1000 طن",
            "Detailed_details": "الطن وحدة قياس ظهرت مع تطور التجارة والصناعة. هناك عدة أنواع من الطن: الطن المتري (1000 كغم)، الطن البريطاني (1016 كغم)، والطن الأمريكي (907 كغم). في النقل البحري، يستخدم الطن لقياس حمولة السفن وكمية البضائع. في الصناعة، يستخدم لقياس إنتاج المصانع والمناجم. في التجارة الدولية، أصبح الطن المتري هو المعيار العالمي. يستخدم أيضاً في قياس استهلاك الموارد الطبيعية وانبعاثات الكربون. في الزراعة، يستخدم لقياس المحاصيل والأسمدة."
        },

        "رطل": {
            "english": "pound",
            "arabic": "رطل",
            "description": "وحدة وزن تقليدية تستخدم في النظام الإنجليزي والأمريكي. يساوي الرطل حوالي 0.454 كيلوغرام. يستخدم في قياس الأوزان المتوسطة في التجارة والطعام.",
            "category": "الوزن",
            "examples": "- وزن اللحم 2 رطل\n- عبوة الدقيق 5 أرطال\n- وزن الطفل 8 أرطال عند الولادة",
            "Detailed_details": "الرطل وحدة قياس قديمة يعود تاريخها إلى الإمبراطورية الرومانية (Libra). تم توحيد الرطل في عام 1959 ليساوي بالضبط 0.45359237 كيلوغرام. يستخدم بشكل رئيسي في الولايات المتحدة وبريطانيا رغم تحول بريطانيا للنظام المتري. في الطب، يستخدم لقياس وزن المواليد في بعض البلدان. في الطبخ الأمريكي، الرطل هو وحدة قياس أساسية للمكونات. يرمز له بـ lb من الكلمة اللاتينية. ينقسم الرطل إلى 16 أوقية في النظام الإنجليزي."
        },
        "أوقية": {
            "english": "ounce",
            "arabic": "أوقية",
            "description": "وحدة وزن تقليدية تساوي 1/16 من الرطل أو حوالي 28.35 غرام. تستخدم في النظام الإنجليزي لقياس الأوزان الخفيفة، خاصة في الطعام والمكونات.",
            "category": "الوزن",
            "examples": "- وزن الذهب 3 أوقيات\n- كمية العطر 2 أوقية\n- حصة الطعام 8 أوقيات",
            "Detailed_details": "الأوقية وحدة قياس قديمة مشتقة من الكلمة اللاتينية 'uncia'. هناك نوعان رئيسيان: أوقية الوزن (28.35 غرام) وأوقية السوائل (29.57 مل). تستخدم في الولايات المتحدة وبريطانيا في وصفات الطعام والمشروبات. في تجارة المعادن الثمينة، تستخدم الأوقية Troy (31.1 غرام) لقياس الذهب والفضة. يرمز لها بـ oz. في الصيدلة، كانت الأوقية وحدة قياس تقليدية قبل التحول للنظام المتري."
        },

        "قيراط": {
            "english": "carat",
            "arabic": "قيراط",
            "description": "وحدة قياس تستخدم في وزن الأحجار الكريمة والذهب. القيراط الواحد يساوي 0.2 غرام في وزن الأحجار الكريمة، وهو أيضاً مقياس لنقاء الذهب (24 قيراط للذهب النقي).",
            "category": "الوزن",
            "examples": "- الماسة 2 قيراط\n- خاتم ذهب عيار 18 قيراط\n- حجر كريم 5 قيراط",
            "Detailed_details": "القيراط كلمة مشتقة من اسم بذور شجرة الخروب التي كانت تستخدم قديماً كوحدة وزن. في المجوهرات، يستخدم القيراط بمعنيين: لقياس وزن الأحجار الكريمة (0.2 غرام) ولقياس نقاء الذهب (جزء من 24). في تجارة الألماس، القيراط هو المعيار العالمي للوزن. في صناعة الذهب، يشير عيار 18 قيراط إلى نسبة 18/24 من الذهب النقي. القيراط له تاريخ يمتد لآلاف السنين في تجارة المجوهرات."
        },

        "قنطار": {
            "english": "quintal",
            "arabic": "قنطار",
            "description": "وحدة وزن تقليدية كبيرة تختلف قيمتها حسب المنطقة والعصر. في النظام المتري الحديث، يساوي القنطار 100 كيلوغرام.",
            "category": "الوزن",
            "examples": "- محصول القمح 50 قنطار\n- شحنة القطن 20 قنطار\n- إنتاج المزرعة 100 قنطار",
            "Detailed_details": "القنطار وحدة وزن تاريخية استخدمت في التجارة والزراعة. اختلفت قيمته بين المناطق، ففي بعض البلدان العربية كان يساوي 44.93 كغم، وفي أخرى 50 كغم. في النظام المتري الحديث، تم توحيد القنطار ليساوي 100 كغم. استخدم تاريخياً في تجارة المحاصيل الزراعية والبضائع الثقيلة. لا يزال يستخدم في بعض البلدان العربية في التجارة الزراعية. في الإحصاءات الزراعية، يستخدم القنطار كوحدة قياس للإنتاج الزراعي."
        },
        "لتر": {
            "english": "liter",
            "arabic": "لتر",
            "description": "وحدة قياس الحجم السائل في النظام المتري. يساوي حجم مكعب طول ضلعه 10 سنتيمترات (1000 سنتيمتر مكعب).",
            "category": "الحجم",
            "examples": "- خزان الماء 100 لتر\n- استهلاك الوقود 50 لتر\n- عبوة الحليب 2 لتر",
            "Detailed_details": "اللتر وحدة قياس حجم أساسية في النظام المتري. يرمز له بـ L أو l. يساوي حجم كيلوغرام واحد من الماء النقي عند درجة حرارة 4 درجات مئوية. يستخدم عالمياً في قياس السوائل والمواد السائبة. في صناعة السيارات، يستخدم لقياس سعة خزان الوقود وزيت المحرك. في الصناعات الغذائية، يستخدم في تعبئة المشروبات والسوائل. يقسم إلى 1000 مليلتر، ويمكن مضاعفته (كيلولتر = 1000 لتر)."
        },
        "مليلتر": {
            "english": "milliliter",
            "arabic": "مليلتر",
            "description": "وحدة قياس صغيرة للحجم تساوي جزء من ألف من اللتر. تستخدم في قياس كميات صغيرة من السوائل، خاصة في الطب والمختبرات والطبخ.",
            "category": "الحجم",
            "examples": "- جرعة الدواء 5 مليلتر\n- عينة الدم 10 مليلتر\n- ملعقة شاي 5 مليلتر",
            "Detailed_details": "المليلتر هو وحدة قياس دقيقة للحجم في النظام المتري. يساوي واحد سنتيمتر مكعب (1 سم³). يستخدم بشكل واسع في المجال الطبي لقياس جرعات الأدوية السائلة. في المختبرات، يستخدم لقياس العينات والمحاليل الكيميائية. في المطبخ، تستخدم الملاعق المعيارية التي تقيس بالمليلتر. يرمز له بـ ml أو mL."
        },

        "متر_مكعب": {
            "english": "cubic_meter",
            "arabic": "متر مكعب",
            "description": "وحدة قياس الحجم الأساسية في النظام المتري. يساوي حجم مكعب طول كل ضلع فيه متر واحد. يستخدم في قياس الأحجام الكبيرة.",
            "category": "الحجم",
            "examples": "- حجم الغرفة 30 متر مكعب\n- خزان المياه 100 متر مكعب\n- حجم الشحنة 50 متر مكعب",
            "Detailed_details": "المتر المكعب هو الوحدة الأساسية للحجم في النظام الدولي للوحدات (SI). يساوي 1000 لتر. يستخدم في الهندسة المعمارية لحساب حجم الغرف والمباني. في الصناعة، يستخدم لقياس خزانات المياه والوقود. في الشحن، يستخدم لحساب حجم البضائع والحاويات. يرمز له بـ m³."
        },

        "مد": {
            "english": "mudd",
            "arabic": "مد",
            "description": "وحدة كيل إسلامية تقليدية تساوي ربع صاع. له أهمية في الفقه الإسلامي وتقدير الصدقات والكفارات.",
            "category": "الحجم",
            "examples": "- كفارة اليمين مد من طعام\n- صدقة مد من قمح\n- زكاة مدين من شعير",
            "Detailed_details": "المد وحدة قياس إسلامية تساوي ما يملأ كفي الإنسان المعتدل. يساوي تقريباً 0.687 كيلوغرام من القمح. استخدم في عهد النبي محمد ﷺ وما بعده. يستخدم في تقدير الكفارات والصدقات في الفقه الإسلامي. المد النبوي هو المعيار المعتمد في الأحكام الشرعية. يساوي ربع الصاع النبوي."
        },

        "قفيز": {
            "english": "qafiz",
            "arabic": "قفيز",
            "description": "وحدة كيل تقليدية استخدمت في العالم العربي والإسلامي. تختلف قيمتها حسب المنطقة والعصر.",
            "category": "الحجم",
            "examples": "- محصول قفيز من القمح\n- أرض تزرع قفيز\n- خراج قفيز من الشعير",
            "Detailed_details": "القفيز وحدة قياس تاريخية استخدمت في الزراعة والخراج. اختلفت قيمته بين المناطق والعصور. في العراق القديم، كان القفيز يساوي 8 مكاكيك. استخدم في تقدير الضرائب والخراج في الدولة الإسلامية. ارتبط القفيز أيضاً بمساحة الأرض التي تزرع بمقدار معين من البذور."
        },

        "كيلة": {
            "english": "keela",
            "arabic": "كيلة",
            "description": "وحدة كيل تقليدية استخدمت في المشرق العربي. تختلف سعتها حسب المنطقة والعصر.",
            "category": "الحجم",
            "examples": "- بيع كيلة من القمح\n- حصة كيلة من الشعير\n- تخزين كيلة من الأرز",
            "Detailed_details": "الكيلة وحدة قياس شعبية استخدمت في التجارة والزراعة. تختلف سعتها بين المناطق، وقد تساوي في بعض المناطق 16-20 كيلوغرام. استخدمت في أسواق الحبوب والمواد الغذائية. لا تزال تستخدم في بعض الأسواق التقليدية. كانت أداة مهمة في التجارة المحلية قبل انتشار النظام المتري."
        },
        "جالون": {
            "english": "gallon",
            "arabic": "جالون",
            "description": "وحدة حجم إنجليزية تساوي حوالي 3.785 لتر (في النظام الأمريكي) أو 4.546 لتر (في النظام البريطاني). تستخدم لقياس السوائل.",
            "category": "الحجم",
            "examples": "- خزان الوقود 15 جالون\n- عبوة الماء 1 جالون\n- استهلاك البنزين 20 جالون",
            "Detailed_details": "الجالون وحدة قياس تختلف قيمتها بين النظام الأمريكي والبريطاني. يستخدم بشكل رئيسي في الولايات المتحدة وبعض دول الخليج لقياس الوقود. في بريطانيا، الجالون الإمبراطوري أكبر من الجالون الأمريكي. يقسم الجالون إلى 4 كوارت أو 8 باينت. يرمز له بـ gal."
        },
        "متر_مربع": {
            "english": "square_meter",
            "arabic": "متر مربع",
            "description": "وحدة قياس المساحة الأساسية في النظام المتري. يساوي مساحة مربع طول ضلعه متر واحد.",
            "category": "المساحة",
            "examples": "- مساحة الغرفة 20 متر مربع\n- مساحة الشقة 100 متر مربع\n- مساحة الحديقة 50 متر مربع",
            "Detailed_details": "المتر المربع هو الوحدة الأساسية لقياس المساحة في النظام الدولي. يرمز له بـ m². يستخدم في العمارة والعقارات وتخطيط المدن. يمكن تحويله إلى وحدات أكبر مثل الكيلومتر المربع أو الهكتار. يستخدم عالمياً في قياس مساحات المباني والأراضي."
        },

        "كيلومتر_مربع": {
            "english": "square_kilometer",
            "arabic": "كيلومتر مربع",
            "description": "وحدة قياس المساحات الكبيرة. يساوي مليون متر مربع. يستخدم في قياس مساحات المدن والدول والمناطق الجغرافية.",
            "category": "المساحة",
            "examples": "- مساحة المدينة 100 كيلومتر مربع\n- مساحة البحيرة 50 كيلومتر مربع\n- مساحة الغابة 200 كيلومتر مربع",
            "Detailed_details": "الكيلومتر المربع وحدة قياس تستخدم للمساحات الكبيرة. يرمز له بـ km². يساوي 100 هكتار. يستخدم في الجغرافيا والتخطيط العمراني. مهم في قياس مساحات المدن والمحميات الطبيعية. يستخدم في الإحصاءات السكانية لحساب الكثافة السكانية."
        },

        "هكتار": {
            "english": "hectare",
            "arabic": "هكتار",
            "description": "وحدة قياس المساحة تساوي 10,000 متر مربع. تستخدم بشكل رئيسي في قياس مساحات الأراضي الزراعية.",
            "category": "المساحة",
            "examples": "- مزرعة مساحتها 5 هكتار\n- حقل قمح 10 هكتار\n- بستان فواكه 2 هكتار",
            "Detailed_details": "الهكتار وحدة قياس زراعية أساسية. يرمز له بـ ha. يساوي مساحة مربع طول ضلعه 100 متر. يستخدم عالمياً في قياس الأراضي الزراعية والغابات. يعادل 2.471 فدان أمريكي. مناسب لقياس المساحات المتوسطة بين المتر المربع والكيلومتر المربع."
        },

        "فدان": {
            "english": "acre",
            "arabic": "فدان",
            "description": "وحدة قياس المساحة الزراعية التقليدية. تختلف قيمته بين البلدان، ففي مصر يساوي 4200 متر مربع.",
            "category": "المساحة",
            "examples": "- أرض زراعية 3 فدان\n- بستان نخيل 5 فدان\n- حقل قطن 10 فدان",
            "Detailed_details": "الفدان وحدة قياس تقليدية تختلف قيمتها حسب البلد. الفدان المصري يساوي 4200 متر مربع أو 24 قيراط. الفدان الإنجليزي يساوي 4047 متر مربع. يستخدم في الزراعة وتسجيل الأراضي. له أهمية تاريخية في النظام الزراعي المصري."
        },

        "دونم": {
            "english": "dunam",
            "arabic": "دونم",
            "description": "وحدة قياس مساحة تساوي 1000 متر مربع. تستخدم في بلاد الشام وتركيا وبعض دول الشرق الأوسط.",
            "category": "المساحة",
            "examples": "- قطعة أرض 5 دونم\n- مزرعة زيتون 20 دونم\n- حديقة فواكه 3 دونم",
            "Detailed_details": "الدونم وحدة قياس عثمانية الأصل. يساوي عُشر الهكتار. لا يزال يستخدم في فلسطين والأردن وسوريا ولبنان وتركيا. يعتبر وحدة قياس مناسبة للملكيات الزراعية الصغيرة. في بعض المناطق يسمى أيضاً بالدنم أو الدونوم."
        },

        "درجة_مئوية": {
            "english": "celsius",
            "arabic": "درجة مئوية",
            "description": "وحدة قياس درجة الحرارة في النظام المتري. نقطة الصفر فيها هي درجة تجمد الماء، و100 درجة هي درجة غليان الماء.",
            "category": "درجة_الحرارة",
            "examples": "- درجة حرارة الغرفة 20 درجة مئوية\n- درجة غليان الماء 100 درجة مئوية\n- درجة تجمد الماء 0 درجة مئوية",
            "Detailed_details": "الدرجة المئوية هي وحدة قياس درجة الحرارة الأكثر استخداماً عالمياً. وضعها العالم السويدي أندرس سيلسيوس عام 1742. تعتمد على خصائص الماء كنقاط مرجعية. يرمز لها بـ °C. تستخدم في الأرصاد الجوية والعلوم والحياة اليومية. سهلة الفهم والاستخدام لارتباطها بظواهر طبيعية مألوفة."
        },
        "درجة_فهرنهايت": {
            "english": "fahrenheit",
            "arabic": "درجة فهرنهايت",
            "description": "وحدة قياس درجة الحرارة في النظام الإنجليزي. نقطة تجمد الماء فيها 32 درجة، ودرجة الغليان 212 درجة.",
            "category": "درجة_الحرارة",
            "examples": "- درجة حرارة الجسم 98.6 فهرنهايت\n- درجة حرارة الطقس 75 فهرنهايت\n- درجة التجميد 32 فهرنهايت",
            "Detailed_details": "مقياس فهرنهايت وضعه العالم الألماني دانيال فهرنهايت عام 1724. يستخدم بشكل رئيسي في الولايات المتحدة. يرمز له بـ °F. يمكن تحويله للدرجة المئوية باستخدام معادلة رياضية. في الطب الأمريكي، يستخدم لقياس حرارة الجسم."
        },

        "كلفن": {
            "english": "kelvin",
            "arabic": "كلفن",
            "description": "وحدة قياس درجة الحرارة المطلقة في النظام الدولي. الصفر فيها يمثل أدنى درجة حرارة ممكنة نظرياً.",
            "category": "درجة_الحرارة",
            "examples": "- درجة الصفر المطلق 0 كلفن\n- درجة غليان الماء 373.15 كلفن\n- درجة تجمد الماء 273.15 كلفن",
            "Detailed_details": "الكلفن هو المقياس العلمي المطلق للحرارة. سمي على اسم العالم وليام طومسون (اللورد كلفن). يرمز له بـ K. يستخدم في الفيزياء والكيمياء والأبحاث العلمية. لا يستخدم درجة في رمزه لأنه مقياس مطلق."
        },

        "بيكومتر": {
            "english": "picometer",
            "arabic": "بيكومتر",
            "description": "وحدة قياس طول صغيرة جداً تساوي جزء من تريليون من المتر. تستخدم في قياس الأبعاد الذرية والجزيئية.",
            "category": "الطول",
            "examples": "- قطر الذرة 100 بيكومتر\n- طول الرابطة الكيميائية 150 بيكومتر\n- حجم الجزيء 200 بيكومتر",
            "Detailed_details": "البيكومتر وحدة قياس في النظام المتري تساوي 10^-12 متر. يستخدم في الفيزياء الذرية والكيمياء الجزيئية. مهم في دراسة البنية الذرية والروابط الكيميائية. يرمز له بـ pm."
        },

        "أنغستروم": {
            "english": "angstrom",
            "arabic": "أنغستروم",
            "description": "وحدة قياس طول تساوي 10^-10 متر. تستخدم في قياس الأطوال الذرية والجزيئية والأطوال الموجية للضوء.",
            "category": "الطول",
            "examples": "- الطول الموجي للضوء المرئي 4000-7000 أنغستروم\n- قطر الذرة 1-5 أنغستروم\n- المسافة بين الذرات 1.5 أنغستروم",
            "Detailed_details": "الأنغستروم سمي على اسم العالم السويدي أندرس أنغستروم. يساوي 100 بيكومتر. يستخدم في الفيزياء والكيمياء وعلم البلورات. يرمز له بـ Å."
        },

        "سنة_ضوئية": {
            "english": "light_year",
            "arabic": "سنة ضوئية",
            "description": "وحدة قياس المسافات الفلكية، تساوي المسافة التي يقطعها الضوء في سنة واحدة.",
            "category": "الطول",
            "examples": "- المسافة إلى النجم القريب 4.2 سنة ضوئية\n- قطر مجرة درب التبانة 100,000 سنة ضوئية\n- المسافة بين المجرات ملايين السنين الضوئية",
            "Detailed_details": "السنة الضوئية تساوي حوالي 9.46 تريليون كيلومتر. تستخدم في علم الفلك لقياس المسافات بين النجوم والمجرات. الضوء يسير بسرعة 299,792 كيلومتر في الثانية. تعتبر وحدة قياس للمسافة وليس للزمن."
        },
        "فرسخ_بحري": {
            "english": "nautical_league",
            "arabic": "فرسخ بحري",
            "description": "وحدة قياس المسافات البحرية التقليدية. يساوي ثلاثة أميال بحرية أو حوالي 5.556 كيلومتر.",
            "category": "الطول",
            "examples": "- المسافة بين الموانئ 10 فراسخ بحرية\n- عمق المياه الإقليمية 20 فرسخ بحري\n- مسار السفينة 15 فرسخ بحري",
            "Detailed_details": "الفرسخ البحري وحدة قياس تاريخية استخدمت في الملاحة البحرية. يختلف عن الفرسخ البري. استخدم في الخرائط البحرية القديمة. يعادل تقريباً مسافة الأفق المرئي من سطح البحر. لا يزال يستخدم في بعض المراجع البحرية التقليدية."
        },

        "ميل_بحري": {
            "english": "nautical_mile",
            "arabic": "ميل بحري",
            "description": "وحدة قياس المسافات البحرية تساوي 1.852 كيلومتر. يستخدم في الملاحة البحرية والجوية.",
            "category": "الطول",
            "examples": "- سرعة السفينة 12 ميل بحري في الساعة\n- ارتفاع الطائرة 5 أميال بحرية\n- المسافة إلى الميناء 20 ميل بحري",
            "Detailed_details": "الميل البحري يساوي دقيقة قوسية واحدة على خط العرض. يستخدم عالمياً في الملاحة البحرية والجوية. يرمز له بـ NM أو nmi. أساسي في حساب السرعة البحرية (العقدة). يسهل حساب المسافات على الخرائط البحرية."
        },
        "بارسك": {
            "english": "parsec",
            "arabic": "بارسك",
            "description": "وحدة قياس المسافات الفلكية تساوي حوالي 3.26 سنة ضوئية. تستخدم في قياس المسافات بين النجوم والمجرات.",
            "category": "الطول",
            "examples": "- المسافة إلى النجم 2 بارسك\n- قطر المجرة 30,000 بارسك\n- البعد عن مركز المجرة 8,000 بارسك",
            "Detailed_details": "البارسك مشتق من مصطلح 'parallax second'. يعتمد على ظاهرة الاختلاف المنظري للنجوم. يساوي حوالي 31 تريليون كيلومتر. يستخدم في علم الفلك الحديث. يعتبر أكثر دقة علمياً من السنة الضوئية."
        },
        "نانوغرام": {
            "english": "nanogram",
            "arabic": "نانوغرام",
            "description": "وحدة قياس كتلة صغيرة جداً تساوي جزء من مليار من الغرام. تستخدم في القياسات العلمية الدقيقة.",
            "category": "الوزن",
            "examples": "- كمية الهرمون 50 نانوغرام\n- تركيز الدواء 100 نانوغرام\n- عينة المادة 25 نانوغرام",
            "Detailed_details": "النانوغرام وحدة قياس في النظام المتري تساوي 10^-9 غرام. يستخدم في البحوث الطبية والكيميائية. مهم في قياس تراكيز الهرمونات والأدوية. يرمز له بـ ng. يستخدم في التحليل الكيميائي الدقيق."
        },
        "ميكروغرام": {
            "english": "microgram",
            "arabic": "ميكروغرام",
            "description": "وحدة قياس كتلة صغيرة تساوي جزء من مليون من الغرام. تستخدم في القياسات الطبية والعلمية.",
            "category": "الوزن",
            "examples": "- جرعة الفيتامين 500 ميكروغرام\n- تركيز المعدن 200 ميكروغرام\n- كمية العنصر 100 ميكروغرام",
            "Detailed_details": "الميكروغرام وحدة قياس تساوي 10^-6 غرام. يرمز له بـ μg. يستخدم في الصناعات الدوائية والتحليل الكيميائي. مهم في قياس الفيتامينات والمعادن النادرة. يستخدم في تحديد الجرعات الدوائية الدقيقة."
        },
        "طن_متري": {
            "english": "metric_ton",
            "arabic": "طن متري",
            "description": "وحدة قياس الكتل الكبيرة تساوي 1000 كيلوغرام. يستخدم في التجارة والصناعة الثقيلة.",
            "category": "الوزن",
            "examples": "- حمولة السفينة 5000 طن متري\n- إنتاج المصنع 100 طن متري يومياً\n- شحنة الفولاذ 500 طن متري",
            "Detailed_details": "الطن المتري هو الوحدة القياسية في النظام المتري. يرمز له بـ t. يستخدم في التجارة الدولية والشحن البحري. يختلف عن الطن الإنجليزي والأمريكي. أساسي في حساب الحمولات الكبيرة والإنتاج الصناعي."
        },
        "طن_قصير": {
            "english": "short_ton",
            "arabic": "طن قصير",
            "description": "وحدة وزن أمريكية تساوي 2000 رطل أو حوالي 907.18 كيلوغرام.",
            "category": "الوزن",
            "examples": "- حمولة الشاحنة 10 طن قصير\n- إنتاج المنجم 500 طن قصير\n- وزن الحاوية 20 طن قصير",
            "Detailed_details": "الطن القصير هو الوحدة المستخدمة في الولايات المتحدة. يختلف عن الطن المتري والطن الطويل. يستخدم في التجارة المحلية الأمريكية. يرمز له بـ st. مهم في صناعة التعدين والنقل الأمريكية."
        },
        "طن_طويل": {
            "english": "long_ton",
            "arabic": "طن طويل",
            "description": "وحدة وزن بريطانية تساوي 2240 رطل أو حوالي 1016.05 كيلوغرام.",
            "category": "الوزن",
            "examples": "- حمولة السفينة 1000 طن طويل\n- وزن البضاعة 50 طن طويل\n- شحنة الفحم 200 طن طويل",
            "Detailed_details": "الطن الطويل وحدة قياس بريطانية تقليدية. يستخدم في التجارة البحرية البريطانية. أكبر من الطن القصير الأمريكي. يرمز له بـ Lt. كان يستخدم في الإمبراطورية البريطانية."
        },
        "ستون": {
            "english": "stone",
            "arabic": "ستون",
            "description": "وحدة وزن بريطانية تساوي 14 رطل أو حوالي 6.35 كيلوغرام.",
            "category": "الوزن",
            "examples": "- وزن الشخص 12 ستون\n- وزن الحيوان 8 ستون\n- فقدان الوزن 2 ستون",
            "Detailed_details": "الستون وحدة وزن تقليدية في بريطانيا وأيرلندا. يستخدم لقياس وزن الإنسان. يرمز له بـ st. لا يزال شائع الاستخدام في المملكة المتحدة. يعادل 14 رطل إنجليزي."
        },
        "جول": {
            "english": "joule",
            "arabic": "جول",
            "description": "وحدة قياس الطاقة في النظام الدولي. يساوي الطاقة اللازمة لتحريك جسم بقوة نيوتن واحد لمسافة متر واحد.",
            "category": "الطاقة",
            "examples": "- طاقة حركية 100 جول\n- طاقة كهربائية 500 جول\n- طاقة حرارية 1000 جول",
            "Detailed_details": "الجول وحدة قياس سميت على اسم العالم جيمس جول. يرمز له بـ J. يستخدم في الفيزياء والهندسة. يساوي واط.ثانية. يستخدم في حساب الطاقة الحركية والحرارية والكهربائية."
        },

        "كيلوجول": {
            "english": "kilojoule",
            "arabic": "كيلوجول",
            "description": "وحدة قياس الطاقة تساوي 1000 جول. تستخدم في قياس القيمة الغذائية للطعام والطاقة الحرارية.",
            "category": "الطاقة",
            "examples": "- قيمة غذائية 200 كيلوجول\n- استهلاك طاقة 500 كيلوجول\n- طاقة حرارية 1000 كيلوجول",
            "Detailed_details": "الكيلوجول وحدة شائعة في تصنيف الأغذية. يرمز له بـ kJ. يستخدم في حساب السعرات الحرارية. مهم في دراسات التغذية والحميات. يستخدم في العمليات الصناعية والكيميائية."
        },

        "كالوري": {
            "english": "calorie",
            "arabic": "سعرة حرارية",
            "description": "وحدة قياس الطاقة الحرارية. تساوي الطاقة اللازمة لرفع درجة حرارة غرام واحد من الماء درجة مئوية واحدة.",
            "category": "الطاقة",
            "examples": "- قيمة غذائية 100 كالوري\n- حرق دهون 500 كالوري\n- وجبة خفيفة 200 كالوري",
            "Detailed_details": "الكالوري وحدة قياس تقليدية للطاقة الحرارية. يرمز لها بـ cal. تستخدم في التغذية وعلم وظائف الأعضاء. السعرة الحرارية الكبيرة تساوي 1000 كالوري صغيرة. تستخدم في حساب القيمة الغذائية للأطعمة."
        },

        "نيوتن": {
            "english": "newton",
            "arabic": "نيوتن",
            "description": "وحدة قياس القوة في النظام الدولي. يساوي القوة اللازمة لتسريع كتلة 1 كغم بمقدار 1 متر/ثانية².",
            "category": "القوة",
            "examples": "- قوة الجاذبية 9.8 نيوتن\n- قوة الدفع 100 نيوتن\n- قوة الشد 50 نيوتن",
            "Detailed_details": "النيوتن سمي على اسم العالم إسحاق نيوتن. يرمز له بـ N. يستخدم في الفيزياء والهندسة. أساسي في حساب القوى والحركة. يستخدم في تصميم الآلات والمنشآت."
        },

        "دين": {
            "english": "dyne",
            "arabic": "دين",
            "description": "وحدة قياس القوة في النظام المطلق. يساوي 10^-5 نيوتن.",
            "category": "القوة",
            "examples": "- قوة شعرية 5 دين\n- قوة سطحية 10 دين\n- قوة مغناطيسية 100 دين",
            "Detailed_details": "الدين وحدة قياس صغيرة للقوة. يستخدم في الفيزياء الدقيقة. مناسب لقياس القوى الصغيرة جداً. يستخدم في دراسة الشد السطحي والقوى الشعرية. مهم في الفيزياء النظرية والتجريبية."
        },

        "باسكال": {
            "english": "pascal",
            "arabic": "باسكال",
            "description": "وحدة قياس الضغط في النظام الدولي. يساوي نيوتن واحد لكل متر مربع.",
            "category": "الضغط",
            "examples": "- ضغط جوي 101325 باسكال\n- ضغط إطار 200000 باسكال\n- ضغط هيدروليكي 50000 باسكال",
            "Detailed_details": "الباسكال سمي على اسم العالم بليز باسكال. يرمز له بـ Pa. يستخدم في الفيزياء والهندسة. مهم في دراسة الموائع والغازات. يستخدم في قياس الضغط الجوي والهيدروليكي."
        },

        "متر_بالثانية": {
            "english": "meter_per_second",
            "arabic": "متر في الثانية",
            "description": "وحدة قياس السرعة في النظام الدولي. تمثل المسافة المقطوعة بالمتر في الثانية الواحدة.",
            "category": "السرعة",
            "examples": "- سرعة الصوت 343 متر/ثانية\n- سرعة الرياح 10 متر/ثانية\n- سرعة الجري 5 متر/ثانية",
            "Detailed_details": "المتر في الثانية هو وحدة السرعة الأساسية. يرمز له بـ m/s. يستخدم في الفيزياء والأرصاد الجوية. مهم في حساب السرعة المتجهة. يستخدم في الدراسات العلمية والهندسية."
        },

        "كيلومتر_بالساعة": {
            "english": "kilometer_per_hour",
            "arabic": "كيلومتر في الساعة",
            "description": "وحدة قياس السرعة الشائعة. تمثل المسافة المقطوعة بالكيلومتر في الساعة الواحدة.",
            "category": "السرعة",
            "examples": "- سرعة السيارة 100 كم/ساعة\n- حد السرعة 120 كم/ساعة\n- سرعة الدراجة 30 كم/ساعة",
            "Detailed_details": "الكيلومتر في الساعة وحدة سرعة شائعة عالمياً. يرمز له بـ km/h. يستخدم في قياس سرعة المركبات. أساسي في قوانين المرور وأنظمة النقل. يمكن تحويله إلى متر/ثانية بالقسمة على 3.6."
        },
        "ميل_بالساعة": {
            "english": "mile_per_hour",
            "arabic": "ميل في الساعة",
            "description": "وحدة قياس السرعة في النظام الإنجليزي. تستخدم في الولايات المتحدة وبريطانيا.",
            "category": "السرعة",
            "examples": "- حد السرعة 60 ميل/ساعة\n- سرعة القطار 70 ميل/ساعة\n- سرعة الرياح 40 ميل/ساعة",
            "Detailed_details": "الميل في الساعة وحدة سرعة شائعة في البلدان الناطقة بالإنجليزية. يرمز له بـ mph. يساوي حوالي 1.61 كم/ساعة. يستخدم في لوحات السرعة على الطرق الأمريكية والبريطانية. مهم في قوانين المرور في هذه البلدان."
        },

        "عقدة": {
            "english": "knot",
            "arabic": "عقدة",
            "description": "وحدة قياس السرعة البحرية. تساوي ميل بحري واحد في الساعة (1.852 كم/ساعة).",
            "category": "السرعة",
            "examples": "- سرعة السفينة 20 عقدة\n- سرعة الرياح البحرية 15 عقدة\n- سرعة القارب 10 عقدة",
            "Detailed_details": "العقدة وحدة سرعة تستخدم في الملاحة البحرية والجوية. يرمز لها بـ kn أو kt. مشتقة من طريقة قياس السرعة التاريخية باستخدام حبل معقود. تستخدم عالمياً في الملاحة البحرية والأرصاد الجوية. مهمة في تخطيط المسارات البحرية والجوية."
        },

        "هرتز": {
            "english": "hertz",
            "arabic": "هرتز",
            "description": "وحدة قياس التردد في النظام الدولي. تمثل عدد الدورات أو الذبذبات في الثانية الواحدة.",
            "category": "التردد",
            "examples": "- تردد التيار الكهربائي 50 هرتز\n- تردد الصوت 440 هرتز\n- تردد الموجات الراديوية 100 ميغاهرتز",
            "Detailed_details": "الهرتز سمي على اسم العالم هاينريش هرتز. يرمز له بـ Hz. يستخدم في قياس الترددات الصوتية والكهربائية والإلكترونية. أساسي في الاتصالات والموسيقى والإلكترونيات. يمتد من الترددات المنخفضة إلى الترددات العالية جداً."
        },

        "بت": {
            "english": "bit",
            "arabic": "بت",
            "description": "وحدة التخزين الرقمي الأساسية. يمثل حالة ثنائية (0 أو 1).",
            "category": "التخزين_الرقمي",
            "examples": "- معدل نقل البيانات 100 ميغابت/ثانية\n- سعة الذاكرة 8 بت\n- ترميز الحرف 7 بت",
            "Detailed_details": "البت هو أصغر وحدة معلومات في الحوسبة. يرمز له بـ b. أساسي في علوم الحاسوب والاتصالات الرقمية. يستخدم في قياس سعة التخزين وسرعة نقل البيانات. ثمانية بت تشكل بايت واحد."
        },

        "بايت": {
            "english": "byte",
            "arabic": "بايت",
            "description": "وحدة تخزين رقمي تساوي 8 بت. تكفي عادة لتمثيل حرف واحد.",
            "category": "التخزين_الرقمي",
            "examples": "- حجم الملف 100 كيلوبايت\n- سعة القرص 500 غيغابايت\n- ذاكرة الحاسوب 8 غيغابايت",
            "Detailed_details": "البايت هو وحدة التخزين الأساسية في الحواسيب. يرمز له بـ B. يمكن تمثيل 256 قيمة مختلفة في بايت واحد. يستخدم في قياس سعة وسائط التخزين وحجم الملفات. أساسي في تنظيم البيانات الرقمية."
        },

        "كيلوبايت": {
            "english": "kilobyte",
            "arabic": "كيلوبايت",
            "description": "وحدة تخزين رقمي تساوي 1024 بايت.",
            "category": "التخزين_الرقمي",
            "examples": "- حجم الصورة 500 كيلوبايت\n- ملف نصي 10 كيلوبايت\n- برنامج صغير 100 كيلوبايت",
            "Detailed_details": "الكيلوبايت وحدة قياس شائعة للملفات الصغيرة. يرمز له بـ KB. يستخدم في قياس حجم النصوص والصور الصغيرة. يساوي 2^10 بايت. مهم في إدارة الملفات والتخزين."
        },

        "ميغابايت": {
            "english": "megabyte",
            "arabic": "ميغابايت",
            "description": "وحدة تخزين رقمي تساوي 1024 كيلوبايت.",
            "category": "التخزين_الرقمي",
            "examples": "- حجم الفيديو 100 ميغابايت\n- برنامج حاسوب 50 ميغابايت\n- ألبوم موسيقي 80 ميغابايت",
            "Detailed_details": "الميغابايت وحدة قياس شائعة للملفات المتوسطة. يرمز له بـ MB. يستخدم في قياس حجم البرامج والوسائط المتعددة. يساوي 2^20 بايت. مهم في تقدير سعة التخزين وسرعة التحميل."
        },

        "غيغابايت": {
            "english": "gigabyte",
            "arabic": "غيغابايت",
            "description": "وحدة تخزين رقمي تساوي 1024 ميغابايت.",
            "category": "التخزين_الرقمي",
            "examples": "- سعة القرص الصلب 1 تيرابايت\n- ذاكرة الهاتف 128 غيغابايت\n- ملف فيديو عالي الدقة 4 غيغابايت",
            "Detailed_details": "الغيغابايت وحدة قياس شائعة في الأجهزة الحديثة. يرمز له بـ GB. يستخدم في قياس سعة الأقراص الصلبة والهواتف. يساوي 2^30 بايت. أساسي في تحديد مواصفات الأجهزة الإلكترونية."
        },

        "تيرابايت": {
            "english": "terabyte",
            "arabic": "تيرابايت",
            "description": "وحدة تخزين رقمي تساوي 1024 غيغابايت.",
            "category": "التخزين_الرقمي",
            "examples": "- سعة خادم البيانات 10 تيرابايت\n- أرشيف الشركة 5 تيرابايت\n- مكتبة الوسائط 2 تيرابايت",
            "Detailed_details": "التيرابايت وحدة قياس للتخزين الكبير. يرمز له بـ TB. يستخدم في الخوادم ومراكز البيانات. يساوي 2^40 بايت. مهم في تخزين البيانات الضخمة والنسخ الاحتياطي."
        },

        "بيتابايت": {
            "english": "petabyte",
            "arabic": "بيتابايت",
            "description": "وحدة تخزين رقمي تساوي 1024 تيرابايت.",
            "category": "التخزين_الرقمي",
            "examples": "- بيانات مركز أبحاث 1 بيتابايت\n- أرشيف إنترنت 10 بيتابايت\n- قاعدة بيانات ضخمة 5 بيتابايت",
            "Detailed_details": "البيتابايت وحدة قياس للتخزين الضخم جداً. يرمز له بـ PB. يستخدم في مراكز البيانات العملاقة. يساوي 2^50 بايت. مهم في الحوسبة السحابية ومراكز البيانات الكبيرة."
        },

        "ثانية": {
            "english": "second",
            "arabic": "ثانية",
            "description": "وحدة الزمن الأساسية في النظام الدولي. تعرف بأنها مدة 9,192,631,770 دورة إشعاع ذرة السيزيوم-133.",
            "category": "الزمن",
            "examples": "- زمن التفاعل 0.5 ثانية\n- مدة النبض 1 ثانية\n- زمن السقوط 2 ثانية",
            "Detailed_details": "الثانية هي الوحدة الأساسية للزمن في النظام الدولي. يرمز لها بـ s. تعريفها مبني على ظاهرة ذرية دقيقة. تستخدم في جميع القياسات العلمية والعملية. أساسية في حساب السرعة والتسارع والتردد."
        },

        "دقيقة": {
            "english": "minute",
            "arabic": "دقيقة",
            "description": "وحدة زمن تساوي 60 ثانية.",
            "category": "الزمن",
            "examples": "- مدة الاجتماع 30 دقيقة\n- وقت الطهي 15 دقيقة\n- فترة الراحة 5 دقائق",
            "Detailed_details": "الدقيقة وحدة زمن شائعة في الحياة اليومية. يرمز لها بـ min. تستخدم في جدولة المواعيد والأنشطة. جزء من النظام الستيني لقياس الزمن. مهمة في تنظيم الأنشطة اليومية والمهنية."
        },

        "ساعة": {
            "english": "hour",
            "arabic": "ساعة",
            "description": "وحدة زمن تساوي 60 دقيقة أو 3600 ثانية.",
            "category": "الزمن",
            "examples": "- يوم عمل 8 ساعات\n- رحلة طيران 3 ساعات\n- مدة النوم 7 ساعات",
            "Detailed_details": "الساعة وحدة زمن أساسية في تنظيم الحياة اليومية. يرمز لها بـ h. تستخدم في قياس فترات العمل والراحة. أساس تقسيم اليوم إلى 24 جزءاً. مهمة في جدولة الأنشطة والمواعيد."
        },

        "درجة": {
            "english": "degree",
            "arabic": "درجة",
            "description": "وحدة قياس الزوايا، تساوي 1/360 من الدائرة الكاملة.",
            "category": "الزوايا",
            "examples": "- زاوية قائمة 90 درجة\n- زاوية منفرجة 120 درجة\n- زاوية حادة 45 درجة",
            "Detailed_details": "الدرجة هي وحدة قياس الزوايا الأكثر شيوعاً. يرمز لها بـ °. تستخدم في الهندسة والملاحة. تقسم الدائرة إلى 360 درجة. مهمة في الرياضيات والفلك والملاحة."
        },

        "راديان": {
            "english": "radian",
            "arabic": "راديان",
            "description": "وحدة قياس الزوايا في النظام الدولي. الراديان هو الزاوية المركزية التي يقابلها قوس طوله يساوي نصف القطر.",
            "category": "الزوايا",
            "examples": "- الدائرة الكاملة 2π راديان\n- الزاوية القائمة π/2 راديان\n- زاوية π/6 راديان",
            "Detailed_details": "الراديان هو وحدة القياس الطبيعية للزوايا. يرمز له بـ rad. يستخدم في الرياضيات والفيزياء. الدائرة الكاملة تساوي 2π راديان. مهم في حساب التفاضل والتكامل والدوال المثلثية."
        },

        "واط": {
            "english": "watt",
            "arabic": "واط",
            "description": "وحدة قياس القدرة في النظام الدولي. يساوي جول واحد في الثانية.",
            "category": "القدرة",
            "examples": "- مصباح كهربائي 60 واط\n- محرك كهربائي 1000 واط\n- جهاز تسخين 2000 واط",
            "Detailed_details": "الواط سمي على اسم العالم جيمس واط. يرمز له بـ W. يقيس معدل تحويل الطاقة أو أدائها. يستخدم في قياس القدرة الكهربائية والميكانيكية. أساسي في حساب استهلاك الطاقة."
        },

        "كيلوواط": {
            "english": "kilowatt",
            "arabic": "كيلوواط",
            "description": "وحدة قياس القدرة تساوي 1000 واط.",
            "category": "القدرة",
            "examples": "- سخان ماء 3 كيلوواط\n- مكيف هواء 2.5 كيلوواط\n- مولد كهربائي 5 كيلوواط",
            "Detailed_details": "الكيلوواط وحدة شائعة لقياس القدرة الكهربائية. يرمز له بـ kW. يستخدم في قياس استهلاك الأجهزة المنزلية. مهم في حساب فواتير الكهرباء. يستخدم في تصنيف الأجهزة الكهربائية."
        },

        "ميغاواط": {
            "english": "megawatt",
            "arabic": "ميغاواط",
            "description": "وحدة قياس القدرة تساوي مليون واط أو 1000 كيلوواط.",
            "category": "القدرة",
            "examples": "- محطة توليد كهرباء 100 ميغاواط\n- توربين رياح 5 ميغاواط\n- محطة طاقة شمسية 50 ميغاواط",
            "Detailed_details": "الميغاواط وحدة قياس للقدرة الكبيرة. يرمز له بـ MW. يستخدم في قياس قدرة محطات توليد الكهرباء. مهم في تخطيط شبكات الطاقة. يستخدم في قياس إنتاج واستهلاك الطاقة على نطاق واسع."
        },
        "حصان": {
            "english": "horsepower",
            "arabic": "حصان",
            "description": "وحدة قياس القدرة تساوي تقريباً 745.7 واط. تستخدم لقياس قدرة المحركات.",
            "category": "القدرة",
            "examples": "- محرك سيارة 150 حصان\n- مضخة مياه 5 حصان\n- محرك قارب 40 حصان",
            "Detailed_details": "الحصان وحدة قدرة تقليدية وضعها جيمس واط. يرمز له بـ hp. يستخدم في قياس قدرة المحركات والآلات. شائع في صناعة السيارات والمعدات. يختلف قليلاً بين النظام البريطاني والأوروبي."
        },

        "متر_بالثانية_المربعة": {
            "english": "meter_per_second_squared",
            "arabic": "متر في الثانية المربعة",
            "description": "وحدة قياس التسارع في النظام الدولي. تمثل التغير في السرعة بمقدار متر واحد في الثانية كل ثانية.",
            "category": "التسارع",
            "examples": "- تسارع الجاذبية 9.81 م/ث²\n- تسارع سيارة 3 م/ث²\n- تباطؤ المكابح 5 م/ث²",
            "Detailed_details": "المتر في الثانية المربعة هو وحدة التسارع الأساسية. يرمز له بـ m/s². يستخدم في الفيزياء والهندسة. مهم في دراسة الحركة والقوى. أساسي في حسابات الديناميكا."
        },

        "فولت": {
            "english": "volt",
            "arabic": "فولت",
            "description": "وحدة قياس فرق الجهد الكهربائي في النظام الدولي. يمثل الجهد اللازم لتوليد تيار قدره 1 أمبير في مقاومة 1 أوم.",
            "category": "الكهرباء",
            "examples": "- بطارية 12 فولت\n- شبكة كهرباء 220 فولت\n- شاحن هاتف 5 فولت",
            "Detailed_details": "الفولت سمي على اسم العالم ألساندرو فولتا. يرمز له بـ V. أساسي في القياسات الكهربائية. يستخدم في تحديد جهد المصادر الكهربائية. مهم في تصميم الأجهزة الكهربائية والإلكترونية."
        },

        "أمبير": {
            "english": "ampere",
            "arabic": "أمبير",
            "description": "وحدة قياس شدة التيار الكهربائي في النظام الدولي. يمثل تدفق الشحنات الكهربائية.",
            "category": "الكهرباء",
            "examples": "- مصهر كهربائي 10 أمبير\n- شاحن بطارية 2 أمبير\n- محول كهربائي 5 أمبير",
            "Detailed_details": "الأمبير سمي على اسم العالم أندريه ماري أمبير. يرمز له بـ A. يقيس معدل تدفق الإلكترونات. أساسي في تصميم الدوائر الكهربائية. مهم في حساب القدرة الكهربائية."
        },

        "لومن": {
            "english": "lumen",
            "arabic": "لومن",
            "description": "وحدة قياس التدفق الضوئي. يمثل كمية الضوء المنبعثة من مصدر ضوئي.",
            "category": "الضوء",
            "examples": "- مصباح LED 800 لومن\n- جهاز عرض 3000 لومن\n- إضاءة شارع 10000 لومن",
            "Detailed_details": "اللومن وحدة قياس كمية الضوء المرئي. يرمز له بـ lm. يستخدم في تصنيف المصابيح وأجهزة الإضاءة. مهم في تصميم الإضاءة المعمارية. يرتبط بوحدة الشمعة في القياس."
        },

        "شمعة": {
            "english": "candela",
            "arabic": "شمعة",
            "description": "وحدة قياس شدة الإضاءة في النظام الدولي. تمثل شدة الضوء المنبعث في اتجاه معين.",
            "category": "الضوء",
            "examples": "- مصباح يدوي 100 شمعة\n- إضاءة طوارئ 50 شمعة\n- مصباح إشارة 25 شمعة",
            "Detailed_details": "الشمعة هي الوحدة الأساسية لشدة الإضاءة. يرمز لها بـ cd. تعتمد على خصائص الإشعاع الأسود. تستخدم في قياس توزيع الضوء. مهمة في تصميم أنظمة الإضاءة."
        },

        "ديسيبل": {
            "english": "decibel",
            "arabic": "ديسيبل",
            "description": "وحدة قياس شدة الصوت. مقياس لوغاريتمي يقيس نسبة التغير في الضغط الصوتي.",
            "category": "الصوت",
            "examples": "- محادثة عادية 60 ديسيبل\n- ضجيج المرور 80 ديسيبل\n- حفل موسيقي 100 ديسيبل",
            "Detailed_details": "الديسيبل وحدة قياس نسبية للصوت. يرمز له بـ dB. يستخدم مقياس لوغاريتمي لملاءمة حساسية الأذن. مهم في قياس التلوث الضوضائي. يستخدم في تصميم العزل الصوتي."
        },

        "باسكال_صوتي": {
            "english": "sound_pressure_pascal",
            "arabic": "باسكال صوتي",
            "description": "وحدة قياس الضغط الصوتي المطلق. يقيس التغيرات في ضغط الهواء الناتجة عن الموجات الصوتية.",
            "category": "الصوت",
            "examples": "- عتبة السمع 20 ميكروباسكال\n- صوت عالٍ 2 باسكال\n- ضجيج مؤذي 20 باسكال",
            "Detailed_details": "الباسكال الصوتي يقيس الضغط الصوتي المطلق. يرمز له بـ Pa. يستخدم في القياسات الصوتية العلمية. مرتبط بمقياس الديسيبل عبر علاقة لوغاريتمية. مهم في دراسة انتشار الصوت وتأثيراته."
        },
        "مول": {
            "english": "mole",
            "arabic": "مول",
            "description": "وحدة قياس كمية المادة في النظام الدولي. يساوي 6.022×10²³ جسيم من المادة.",
            "category": "كيميائية",
            "examples": "- تفاعل كيميائي 2 مول\n- محلول ملحي 1 مول\n- غاز 0.5 مول",
            "Detailed_details": "المول هو الوحدة الأساسية لكمية المادة. يرمز له بـ mol. يحتوي على عدد أفوجادرو من الجسيمات. مهم في الحسابات الكيميائية. يستخدم في حساب التفاعلات والتراكيز."
        },

        "عيارية": {
            "english": "normality",
            "arabic": "عيارية",
            "description": "وحدة قياس تركيز المحاليل تعبر عن عدد المكافئات الغرامية في لتر من المحلول.",
            "category": "كيميائية",
            "examples": "- حمض 0.1 عياري\n- قلوي 1 عياري\n- محلول 0.5 عياري",
            "Detailed_details": "العيارية تقيس تركيز المحاليل حسب التكافؤ. يرمز لها بـ N. تستخدم في المعايرات الكيميائية. مهمة في تحليل الأحماض والقواعد. تعتمد على عدد الهيدروجينات النشطة."
        },

        "مولارية": {
            "english": "molarity",
            "arabic": "مولارية",
            "description": "وحدة قياس تركيز المحاليل تعبر عن عدد المولات في لتر من المحلول.",
            "category": "كيميائية",
            "examples": "- محلول ملحي 0.5 مولاري\n- حمض 1 مولاري\n- محلول سكري 0.1 مولاري",
            "Detailed_details": "المولارية هي التركيز المولي للمحلول. يرمز لها بـ M. تستخدم في المختبرات الكيميائية. مهمة في تحضير المحاليل القياسية. تتغير مع درجة الحرارة."
        },

        "جزء_بالمليون": {
            "english": "ppm",
            "arabic": "جزء بالمليون",
            "description": "وحدة قياس التركيز تعبر عن عدد أجزاء المذاب في مليون جزء من المحلول.",
            "category": "كيميائية",
            "examples": "- تلوث مياه 100 جزء بالمليون\n- ملوثات هواء 50 جزء بالمليون\n- معادن ثقيلة 10 جزء بالمليون",
            "Detailed_details": "الجزء بالمليون يقيس التراكيز الضئيلة. يرمز له بـ ppm. يستخدم في تحليل الملوثات. مهم في دراسات البيئة وجودة المياه. يعادل ملغرام لكل لتر في المحاليل المائية."
        },

        "جزء_بالمليار": {
            "english": "ppb",
            "arabic": "جزء بالمليار",
            "description": "وحدة قياس التركيز تعبر عن عدد أجزاء المذاب في مليار جزء من المحلول.",
            "category": "كيميائية",
            "examples": "- آثار معادن 100 جزء بالمليار\n- ملوثات دقيقة 50 جزء بالمليار\n- مبيدات 10 جزء بالمليار",
            "Detailed_details": "الجزء بالمليار يقيس التراكيز المتناهية الصغر. يرمز له بـ ppb. يستخدم في التحليل الدقيق. مهم في الكشف عن الملوثات النادرة. يعادل ميكروغرام لكل لتر في المحاليل المائية."
        },

        "تسلا": {
            "english": "tesla",
            "arabic": "تسلا",
            "description": "وحدة قياس كثافة الفيض المغناطيسي في النظام الدولي.",
            "category": "مغناطيسية",
            "examples": "- مجال مغناطيسي أرضي 50 ميكروتسلا\n- مغناطيس قوي 1 تسلا\n- جهاز رنين مغناطيسي 3 تسلا",
            "Detailed_details": "التسلا سمي على اسم العالم نيكولا تسلا. يرمز له بـ T. يقيس قوة المجال المغناطيسي. يستخدم في الأجهزة الطبية والعلمية. مهم في تصميم المحركات والمولدات الكهربائية."
        },

        "غاوس": {
            "english": "gauss",
            "arabic": "غاوس",
            "description": "وحدة قياس الحث المغناطيسي في النظام السنتيمتري. يساوي 10⁻⁴ تسلا.",
            "category": "مغناطيسية",
            "examples": "- مجال مغناطيسي 500 غاوس\n- مغناطيس دائم 1000 غاوس\n- درع مغناطيسي 100 غاوس",
            "Detailed_details": "الغاوس سمي على اسم العالم كارل فريدريش غاوس. يرمز له بـ G. وحدة قديمة لا تزال مستخدمة. يستخدم في قياس المجالات المغناطيسية المتوسطة. مهم في تطبيقات الحماية المغناطيسية."
        },

        "ويبر": {
            "english": "weber",
            "arabic": "ويبر",
            "description": "وحدة قياس التدفق المغناطيسي في النظام الدولي. يساوي تسلا × متر مربع.",
            "category": "مغناطيسية",
            "examples": "- تدفق مغناطيسي 1 ويبر\n- محول كهربائي 0.5 ويبر\n- ملف حثي 0.1 ويبر",
            "Detailed_details": "الويبر سمي على اسم العالم فيلهلم إدوارد ويبر. يرمز له بـ Wb. يقيس التدفق المغناطيسي الكلي. مهم في تصميم المحولات والمحركات. يستخدم في حساب الحث الكهرومغناطيسي."
        },

        "أمبير_لفة": {
            "english": "ampere_turn",
            "arabic": "أمبير لفة",
            "description": "وحدة قياس القوة الدافعة المغناطيسية. تساوي التيار × عدد لفات الملف.",
            "category": "مغناطيسية",
            "examples": "- ملف كهربائي 100 أمبير لفة\n- محول 500 أمبير لفة\n- مغناطيس كهربائي 1000 أمبير لفة",
            "Detailed_details": "الأمبير لفة يقيس القوة المغناطيسية للملفات. يرمز له بـ At. يستخدم في تصميم المحولات والملفات. مهم في حساب المجال المغناطيسي. أساسي في تصميم الأجهزة الكهرومغناطيسية."
        },

        "هيكتوباسكال": {
            "english": "hectopascal",
            "arabic": "هيكتوباسكال",
            "description": "وحدة قياس الضغط الجوي تساوي 100 باسكال.",
            "category": "الضغط_الجوي",
            "examples": "- ضغط جوي عادي 1013 هيكتوباسكال\n- منخفض جوي 995 هيكتوباسكال\n- مرتفع جوي 1025 هيكتوباسكال",
            "Detailed_details": "الهيكتوباسكال وحدة شائعة في الأرصاد الجوية. يرمز له بـ hPa. يستخدم في التنبؤ بالطقس. يعادل المليبار في القياس. مهم في دراسة الأنظمة الجوية."
        },

        "إنش_زئبقي": {
            "english": "inch_of_mercury",
            "arabic": "إنش زئبقي",
            "description": "وحدة قياس الضغط الجوي الأمريكية. يساوي ارتفاع عمود الزئبق بالإنش.",
            "category": "الضغط_الجوي",
            "examples": "- ضغط جوي عادي 29.92 إنش زئبقي\n- منخفض جوي 29.5 إنش زئبقي\n- مرتفع جوي 30.5 إنش زئبقي",
            "Detailed_details": "الإنش الزئبقي وحدة تقليدية في أمريكا. يرمز له بـ inHg. يستخدم في قياس الضغط الجوي. شائع في التنبؤات الجوية الأمريكية. يعادل حوالي 33.86 مليبار."
        },

        "مليمتر_زئبقي": {
            "english": "millimeter_of_mercury",
            "arabic": "مليمتر زئبقي",
            "description": "وحدة قياس ضغط الدم وضغط الغازات. يساوي ارتفاع عمود الزئبق بالمليمتر.",
            "category": "الضغط_الجوي",
            "examples": "- ضغط دم طبيعي 120/80 مليمتر زئبقي\n- ضغط جوي 760 مليمتر زئبقي\n- ضغط غاز 100 مليمتر زئبقي",
            "Detailed_details": "المليمتر الزئبقي وحدة طبية شائعة. يرمز له بـ mmHg. يستخدم في قياس ضغط الدم. مهم في التشخيص الطبي. يعادل حوالي 1.33322 مليبار."
        },

        "تور": {
            "english": "torr",
            "arabic": "تور",
            "description": "وحدة قياس الضغط المنخفض. يساوي مليمتر زئبقي واحد.",
            "category": "الضغط_الجوي",
            "examples": "- ضغط تفريغ 1 تور\n- ضغط غاز نادر 0.1 تور\n- ضغط مختبري 10 تور",
            "Detailed_details": "التور سمي على اسم العالم إيفانجيليستا توريتشيلي. يرمز له بـ Torr. يستخدم في قياس الضغط المنخفض. مهم في تطبيقات التفريغ. شائع في المختبرات العلمية."
        },

        "بت_بالثانية": {
            "english": "bits_per_second",
            "arabic": "بت في الثانية",
            "description": "وحدة قياس سرعة نقل البيانات الرقمية.",
            "category": "نقل_البيانات",
            "examples": "- اتصال تسلسلي 9600 بت/ثانية\n- نقل بيانات 1000 بت/ثانية\n- معدل إرسال 2400 بت/ثانية",
            "Detailed_details": "البت في الثانية وحدة أساسية لنقل البيانات. يرمز له بـ bps. يقيس عدد البتات المنقولة في الثانية. مهم في الاتصالات الرقمية. أساسي في تقييم سرعة الاتصال."
        },

        "كيلوبت_بالثانية": {
            "english": "kilobits_per_second",
            "arabic": "كيلوبت في الثانية",
            "description": "وحدة قياس سرعة نقل البيانات تساوي 1000 بت في الثانية.",
            "category": "نقل_البيانات",
            "examples": "- اتصال إنترنت 256 كيلوبت/ثانية\n- نقل ملف 512 كيلوبت/ثانية\n- بث صوتي 128 كيلوبت/ثانية",
            "Detailed_details": "الكيلوبت في الثانية وحدة شائعة لقياس سرعة الإنترنت. يرمز له بـ kbps. يستخدم في قياس سرعات الاتصال المنخفضة. مهم في تقييم جودة الخدمة. شائع في خدمات الإنترنت القديمة."
        },

        "ميغابت_بالثانية": {
            "english": "megabits_per_second",
            "arabic": "ميغابت في الثانية",
            "description": "وحدة قياس سرعة نقل البيانات تساوي مليون بت في الثانية.",
            "category": "نقل_البيانات",
            "examples": "- اتصال منزلي 100 ميغابت/ثانية\n- شبكة محلية 1000 ميغابت/ثانية\n- بث فيديو 10 ميغابت/ثانية",
            "Detailed_details": "الميغابت في الثانية وحدة قياس سرعات الإنترنت العالية. يرمز له بـ Mbps. يستخدم في خدمات الإنترنت السريع. مهم في تقييم خدمات النطاق العريض. أساسي في بث الوسائط المتعددة."
        },

        "غيغابت_بالثانية": {
            "english": "gigabits_per_second",
            "arabic": "غيغابت في الثانية",
            "description": "وحدة قياس سرعة نقل البيانات تساوي مليار بت في الثانية.",
            "category": "نقل_البيانات",
            "examples": "- شبكة ألياف ضوئية 1 غيغابت/ثانية\n- اتصال مؤسسي 10 غيغابت/ثانية\n- نقل بيانات ضخمة 40 غيغابت/ثانية",
            "Detailed_details": "الغيغابت في الثانية وحدة قياس السرعات العالية جداً. يرمز له بـ Gbps. يستخدم في الشبكات المتقدمة. مهم في مراكز البيانات. أساسي في البنية التحتية للإنترنت."
        },

        "ميكروغرام_بالمتر_المكعب": {
            "english": "microgram_per_cubic_meter",
            "arabic": "ميكروغرام في المتر المكعب",
            "description": "وحدة قياس تركيز الملوثات في الهواء.",
            "category": "جودة_الهواء",
            "examples": "- جسيمات دقيقة PM2.5 25 ميكروغرام/م³\n- غبار عالق 50 ميكروغرام/م³\n- ملوثات صناعية 100 ميكروغرام/م³",
            "Detailed_details": "الميكروغرام في المتر المكعب وحدة قياس تركيز الملوثات. يرمز له بـ µg/m³. يستخدم في مراقبة جودة الهواء. مهم في تقييم التلوث البيئي. أساسي في وضع المعايير البيئية."
        },

        "نسبة_مئوية_رطوبة": {
            "english": "relative_humidity_percent",
            "arabic": "نسبة مئوية رطوبة",
            "description": "وحدة قياس الرطوبة النسبية في الهواء.",
            "category": "الرطوبة",
            "examples": "- رطوبة مريحة 45%\n- رطوبة عالية 80%\n- رطوبة منخفضة 20%",
            "Detailed_details": "النسبة المئوية للرطوبة تقيس كمية بخار الماء في الهواء. يرمز لها بـ RH%. تؤثر على الشعور بالراحة. مهمة في التحكم المناخي. تختلف حسب درجة الحرارة."
        },

        "ريختر": {
            "english": "richter",
            "arabic": "ريختر",
            "description": "مقياس لوغاريتمي لقياس قوة الزلازل.",
            "category": "الزلازل",
            "examples": "- زلزال خفيف 3 ريختر\n- زلزال متوسط 5 ريختر\n- زلزال مدمر 7 ريختر",
            "Detailed_details": "مقياس ريختر وضعه تشارلز ريختر. يقيس الطاقة المنطلقة من الزلزال. كل درجة تمثل زيادة عشرة أضعاف في القوة. يستخدم عالمياً في رصد الزلازل. مهم في تقييم المخاطر الزلزالية."
        },

        "ميركالي": {
            "english": "mercalli",
            "arabic": "ميركالي",
            "description": "مقياس لقياس شدة الزلازل حسب تأثيراتها الملحوظة.",
            "category": "الزلازل",
            "examples": "- اهتزاز خفيف III ميركالي\n- أضرار متوسطة VI ميركالي\n- دمار شامل X ميركالي",
            "Detailed_details": "مقياس ميركالي يقيس آثار الزلزال على السطح. يتراوح من I إلى XII. يعتمد على الملاحظات البشرية. مهم في تقييم الأضرار. يكمل مقياس ريختر في دراسة الزلازل."
        },

        "بوفورت": {
            "english": "beaufort",
            "arabic": "بوفورت",
            "description": "مقياس لقوة الرياح يعتمد على تأثيراتها المرئية.",
            "category": "سرعة_الرياح",
            "examples": "- نسيم خفيف 2 بوفورت\n- رياح قوية 6 بوفورت\n- عاصفة 9 بوفورت",
            "Detailed_details": "مقياس بوفورت وضعه فرانسيس بوفورت. يتراوح من 0 إلى 12. يعتمد على الملاحظات البصرية. مهم في الملاحة البحرية. يستخدم في التنبؤات الجوية."
        },

        "مؤشر_جودة_الهواء": {
            "english": "air_quality_index",
            "arabic": "مؤشر جودة الهواء",
            "description": "مقياس لجودة الهواء يتراوح من 0 إلى 500.",
            "category": "جودة_الهواء",
            "examples": "- هواء نظيف 50\n- هواء معتدل التلوث 100\n- هواء ملوث 200",
            "Detailed_details": "مؤشر جودة الهواء يقيس مستوى تلوث الهواء. يعتمد على قياس عدة ملوثات. مهم في التحذير من التلوث. يستخدم في التقارير البيئية اليومية. يساعد في اتخاذ الإجراءات الوقائية."
        },

        "جزء_بالمليون_حجمي": {
            "english": "parts_per_million_volume",
            "arabic": "جزء بالمليون حجمي",
            "description": "وحدة قياس تركيز الغازات في الهواء.",
            "category": "جودة_الهواء",
            "examples": "- ثاني أكسيد الكربون 400 جزء بالمليون\n- أول أكسيد الكربون 9 جزء بالمليون\n- أكاسيد النيتروجين 0.1 جزء بالمليون",
            "Detailed_details": "الجزء بالمليون الحجمي يقيس تركيز الغازات. يرمز له بـ ppmv. يستخدم في مراقبة الملوثات الغازية. مهم في دراسات تلوث الهواء. أساسي في قياسات الغازات الدفيئة."
        },

        "غرام_بالمتر_المكعب": {
            "english": "grams_per_cubic_meter",
            "arabic": "غرام في المتر المكعب",
            "description": "وحدة قياس الرطوبة المطلقة في الهواء.",
            "category": "الرطوبة",
            "examples": "- رطوبة منخفضة 5 غ/م³\n- رطوبة متوسطة 10 غ/م³\n- رطوبة عالية 15 غ/م³",
            "Detailed_details": "الغرام في المتر المكعب يقيس كمية بخار الماء المطلقة. يرمز له بـ g/m³. يختلف عن الرطوبة النسبية. مهم في الدراسات المناخية. يستخدم في تصميم أنظمة التكييف."
        },

        "نقطة_الندى": {
            "english": "dew_point",
            "arabic": "نقطة الندى",
            "description": "درجة الحرارة التي يبدأ عندها تكثف بخار الماء في الهواء.",
            "category": "الرطوبة",
            "examples": "- نقطة ندى منخفضة 5°م\n- نقطة ندى متوسطة 15°م\n- نقطة ندى عالية 20°م",
            "Detailed_details": "نقطة الندى مؤشر مهم للرطوبة. تقاس بالدرجة المئوية. تستخدم في التنبؤ بالضباب والصقيع. مهمة في الأرصاد الجوية. تؤثر على الشعور بالراحة الحرارية."
        },

        "درجة_زلزالية": {
            "english": "moment_magnitude",
            "arabic": "درجة زلزالية",
            "description": "مقياس عزم الزلازل الحديث البديل لمقياس ريختر.",
            "category": "الزلازل",
            "examples": "- زلزال صغير 3.5 درجة\n- زلزال متوسط 6.0 درجة\n- زلزال كبير 8.0 درجة",
            "Detailed_details": "الدرجة الزلزالية تقيس طاقة الزلزال. تستخدم في الزلازل الكبيرة. أدق من مقياس ريختر. مهمة في الدراسات الزلزالية. تعتمد على حساب عزم الزلزال."
        },

        "عقدة_بحرية": {
            "english": "nautical_knot",
            "arabic": "عقدة بحرية",
            "description": "وحدة قياس السرعة البحرية تساوي ميل بحري في الساعة.",
            "category": "سرعة_الرياح",
            "examples": "- رياح خفيفة 10 عقدة\n- رياح متوسطة 20 عقدة\n- رياح قوية 40 عقدة",
            "Detailed_details": "العقدة البحرية وحدة سرعة بحرية تقليدية. تساوي 1.852 كم/ساعة. تستخدم في الملاحة البحرية والجوية. مهمة في قياس سرعة الرياح البحرية. أساسية في التنبؤات الجوية البحرية."
        },
        "مؤشر_تلوث_المياه": {
            "english": "water_pollution_index",
            "arabic": "مؤشر تلوث المياه",
            "description": "مقياس لدرجة تلوث المياه من 0 إلى 100.",
            "category": "التلوث",
            "examples": "- مياه نظيفة 10\n- تلوث متوسط 50\n- تلوث شديد 90",
            "Detailed_details": "مؤشر يقيس جودة المياه وتلوثها. يعتمد على عدة معايير كيميائية وفيزيائية. يشمل قياس المواد العضوية والمعادن الثقيلة. مهم في مراقبة جودة المياه. يستخدم في التقارير البيئية."
        },

        "واط_بالمتر_المربع": {
            "english": "watt_per_square_meter",
            "arabic": "واط بالمتر المربع",
            "description": "وحدة قياس شدة الإشعاع الشمسي.",
            "category": "الإشعاع_الشمسي",
            "examples": "- إشعاع ضعيف 200 واط/م²\n- إشعاع متوسط 600 واط/م²\n- إشعاع قوي 1000 واط/م²",
            "Detailed_details": "يقيس كمية الطاقة الشمسية الساقطة. يرمز له بـ W/m². مهم في تصميم الأنظمة الشمسية. يتغير حسب الموقع والوقت. أساسي في دراسات الطاقة المتجددة."
        },

        "لانغلي": {
            "english": "langley",
            "arabic": "لانغلي",
            "description": "وحدة قياس الطاقة الشمسية المتراكمة.",
            "category": "الإشعاع_الشمسي",
            "examples": "- إشعاع يومي 300 لانغلي\n- إشعاع صيفي 600 لانغلي\n- إشعاع صحراوي 800 لانغلي",
            "Detailed_details": "اللانغلي يساوي سعر حراري/سم². سمي على اسم العالم صامويل لانغلي. يستخدم في الدراسات المناخية. مهم في حساب الطاقة الشمسية. يقيس الإشعاع اليومي المتراكم."
        },

        "كيلوواط_ساعة_بالمتر_المربع": {
            "english": "kilowatt_hour_per_square_meter",
            "arabic": "كيلوواط ساعة بالمتر المربع",
            "description": "وحدة قياس الطاقة الشمسية المتراكمة.",
            "category": "الإشعاع_الشمسي",
            "examples": "- إشعاع يومي 5 كيلوواط ساعة/م²\n- إشعاع شهري 150 كيلوواط ساعة/م²\n- إشعاع سنوي 1800 كيلوواط ساعة/م²",
            "Detailed_details": "يقيس الطاقة الشمسية المتوفرة. يرمز له بـ kWh/m². مهم في تصميم محطات الطاقة الشمسية. يستخدم في حساب الجدوى الاقتصادية. أساسي في تخطيط المشاريع الشمسية."
        },

        "متر_مد": {
            "english": "tide_meter",
            "arabic": "متر مد",
            "description": "وحدة قياس ارتفاع المد والجزر.",
            "category": "المد_والجزر",
            "examples": "- مد منخفض 0.5 متر\n- مد متوسط 2 متر\n- مد مرتفع 4 متر",
            "Detailed_details": "يقيس ارتفاع مستوى الماء عن المتوسط. يستخدم في الموانئ والملاحة. مهم في التنبؤ بحركة المد. يتأثر بجاذبية القمر والشمس. أساسي في الأنشطة البحرية."
        },

        "قدم_مد": {
            "english": "tide_foot",
            "arabic": "قدم مد",
            "description": "وحدة قياس ارتفاع المد والجزر بالقدم.",
            "category": "المد_والجزر",
            "examples": "- مد منخفض 2 قدم\n- مد متوسط 6 قدم\n- مد مرتفع 12 قدم",
            "Detailed_details": "وحدة شائعة في البلدان الإنجليزية. يساوي 0.3048 متر. يستخدم في الخرائط البحرية. مهم في الملاحة التقليدية. شائع في الموانئ الأمريكية والبريطانية."
        },

        "معامل_المد": {
            "english": "tide_coefficient",
            "arabic": "معامل المد",
            "description": "مقياس لقوة المد والجزر من 20 إلى 120.",
            "category": "المد_والجزر",
            "examples": "- مد ضعيف 30\n- مد متوسط 70\n- مد قوي 100",
            "Detailed_details": "يقيس شدة ظاهرة المد والجزر. يتأثر بموقع القمر والشمس. مهم في التنبؤ بالمد العالي. يستخدم في الملاحة البحرية. أساسي في تخطيط الأنشطة الساحلية."
        },
        "فاثوم": {
            "english": "fathom",
            "arabic": "فاثوم",
            "description": "وحدة قياس عمق المياه البحرية تساوي 6 أقدام.",
            "category": "عمق_المياه",
            "examples": "- مياه ضحلة 5 فاثوم\n- عمق متوسط 20 فاثوم\n- مياه عميقة 100 فاثوم",
            "Detailed_details": "الفاثوم وحدة بحرية تقليدية. يساوي 1.8288 متر. يستخدم في الملاحة البحرية. مهم في الخرائط البحرية. شائع في البحرية البريطانية والأمريكية."
        },

        "متر_بحري": {
            "english": "marine_meter",
            "arabic": "متر بحري",
            "description": "وحدة قياس عمق المياه في النظام المتري.",
            "category": "عمق_المياه",
            "examples": "- مياه ساحلية 10 متر\n- جرف قاري 200 متر\n- أعماق سحيقة 4000 متر",
            "Detailed_details": "المتر البحري وحدة قياس دولية للعمق. يستخدم في المسح البحري الحديث. مهم في الدراسات الأوقيانوغرافية. أساسي في الخرائط البحرية الحديثة. دقيق في قياس الأعماق."
        },

        "قامة": {
            "english": "depth_foot",
            "arabic": "قامة",
            "description": "وحدة قياس عمق المياه التقليدية تساوي طول الإنسان.",
            "category": "عمق_المياه",
            "examples": "- مياه ضحلة قامة واحدة\n- عمق متوسط 3 قامات\n- مياه عميقة 10 قامات",
            "Detailed_details": "القامة وحدة قياس تقليدية عربية. تساوي حوالي 1.7 متر. تستخدم في الصيد التقليدي. مهمة في الملاحة الساحلية. شائعة في المجتمعات البحرية العربية."
        },

        "لتر_بالمئة_كيلومتر": {
            "english": "liters_per_hundred_kilometers",
            "arabic": "لتر لكل مئة كيلومتر",
            "description": "معدل استهلاك الوقود في النظام الأوروبي.",
            "category": "استهلاك_الوقود",
            "examples": "- سيارة اقتصادية 5 لتر/100كم\n- استهلاك متوسط 8 لتر/100كم\n- استهلاك مرتفع 12 لتر/100كم",
            "Detailed_details": "وحدة قياس شائعة في أوروبا وآسيا. تقيس كمية الوقود المستهلكة. كلما قل الرقم كان أفضل. مهمة في مقارنة كفاءة السيارات. تستخدم في المواصفات الفنية للمركبات."
        },

        "ميل_بالغالون": {
            "english": "miles_per_gallon",
            "arabic": "ميل بالغالون",
            "description": "معدل استهلاك الوقود في النظام الأمريكي.",
            "category": "استهلاك_الوقود",
            "examples": "- سيارة اقتصادية 40 ميل/غالون\n- استهلاك متوسط 25 ميل/غالون\n- استهلاك مرتفع 15 ميل/غالون",
            "Detailed_details": "وحدة قياس شائعة في أمريكا وبريطانيا. كلما زاد الرقم كان أفضل. يقيس المسافة المقطوعة بغالون واحد. مهم في تصنيف كفاءة السيارات. يستخدم في مواصفات السيارات الأمريكية."
        },
        "كيلومتر_باللتر": {
            "english": "kilometers_per_liter",
            "arabic": "كيلومتر باللتر",
            "description": "كفاءة استهلاك الوقود في النظام المتري.",
            "category": "استهلاك_الوقود",
            "examples": "- سيارة اقتصادية 20 كم/لتر\n- استهلاك متوسط 12 كم/لتر\n- استهلاك مرتفع 8 كم/لتر",
            "Detailed_details": "وحدة قياس سهلة الفهم والحساب. كلما زاد الرقم كان أفضل. يقيس المسافة المقطوعة بلتر واحد. مهم في حساب تكلفة الرحلات. شائع في العديد من الدول."
        },

        "متر_بالثانية_رياح": {
            "english": "meters_per_second_wind",
            "arabic": "متر في الثانية للرياح",
            "description": "وحدة قياس سرعة الرياح في النظام الدولي.",
            "category": "سرعة_الرياح",
            "examples": "- نسيم خفيف 2 م/ث\n- رياح معتدلة 8 م/ث\n- رياح قوية 15 م/ث",
            "Detailed_details": "المتر في الثانية وحدة قياس علمية للرياح. يرمز له بـ m/s. يستخدم في الأبحاث المناخية. مهم في النماذج الجوية. أساسي في القياسات الدقيقة للرياح."
        },

        "كيلومتر_بالساعة_رياح": {
            "english": "kilometers_per_hour_wind",
            "arabic": "كيلومتر في الساعة للرياح",
            "description": "وحدة قياس سرعة الرياح الشائعة.",
            "category": "سرعة_الرياح",
            "examples": "- رياح خفيفة 20 كم/س\n- رياح متوسطة 40 كم/س\n- عاصفة 80 كم/س",
            "Detailed_details": "الكيلومتر في الساعة وحدة شائعة لقياس الرياح. يرمز له بـ km/h. يستخدم في النشرات الجوية العامة. سهل الفهم للعامة. مناسب للتنبؤات اليومية."
        },

        "مؤشر_جودة_الهواء_عالمي": {
            "english": "global_air_quality_index",
            "arabic": "مؤشر جودة الهواء العالمي",
            "description": "مقياس عالمي موحد لجودة الهواء من 0 إلى 500.",
            "category": "التلوث",
            "examples": "- جودة ممتازة 25\n- جودة متوسطة 75\n- تلوث خطير 300",
            "Detailed_details": "مؤشر عالمي موحد لقياس جودة الهواء. يعتمد معايير منظمة الصحة العالمية. يشمل قياس عدة ملوثات. مهم في المقارنات الدولية. يستخدم في التقارير البيئية العالمية."
        },

        "ميكروغرام_جسيمات": {
            "english": "particulate_matter",
            "arabic": "ميكروغرام جسيمات",
            "description": "تركيز الجسيمات العالقة في الهواء.",
            "category": "التلوث",
            "examples": "- PM2.5 15 ميكروغرام/م³\n- PM10 45 ميكروغرام/م³\n- غبار عالق 100 ميكروغرام/م³",
            "Detailed_details": "يقيس تركيز الجسيمات الدقيقة في الهواء. يرمز له بـ PM. مهم في تقييم جودة الهواء. يؤثر على الصحة التنفسية. يستخدم في مراقبة التلوث الصناعي."
        },

        "كيلوواط_ذروة": {
            "english": "kilowatt_peak",
            "arabic": "كيلوواط ذروة",
            "description": "قدرة الألواح الشمسية في الظروف المثالية.",
            "category": "الطاقة_المتجددة",
            "examples": "- نظام منزلي 5 كيلوواط ذروة\n- محطة صغيرة 100 كيلوواط ذروة\n- مزرعة شمسية 1000 كيلوواط ذروة",
            "Detailed_details": "الكيلوواط ذروة يقيس القدرة القصوى للألواح الشمسية. يرمز له بـ kWp. يقاس في ظروف اختبار قياسية. مهم في تصميم الأنظمة الشمسية. يستخدم في حساب الإنتاج المتوقع."
        },

        "ميغاواط_ريحي": {
            "english": "wind_megawatt",
            "arabic": "ميغاواط ريحي",
            "description": "قدرة توربينات الرياح.",
            "category": "الطاقة_المتجددة",
            "examples": "- توربين صغير 1 ميغاواط\n- مزرعة رياح 50 ميغاواط\n- محطة كبيرة 200 ميغاواط",
            "Detailed_details": "الميغاواط الريحي يقيس قدرة توربينات الرياح. يرمز له بـ MW. يعتمد على سرعة الرياح المتوفرة. مهم في تخطيط مزارع الرياح. يستخدم في تقييم مشاريع الطاقة المتجددة."
        },

        "جيغاواط_ساعة_متجددة": {
            "english": "renewable_gigawatt_hour",
            "arabic": "جيغاواط ساعة متجددة",
            "description": "إنتاج الطاقة المتجددة.",
            "category": "الطاقة_المتجددة",
            "examples": "- إنتاج يومي 10 جيغاواط ساعة\n- إنتاج شهري 300 جيغاواط ساعة\n- إنتاج سنوي 3600 جيغاواط ساعة",
            "Detailed_details": "الجيغاواط ساعة يقيس إنتاج الطاقة المتجددة. يرمز له بـ GWh. يستخدم في قياس الإنتاج الكبير. مهم في تخطيط شبكات الكهرباء. يساعد في تقييم مساهمة الطاقة المتجددة."
        },
        "فون": {
            "english": "phon",
            "arabic": "فون",
            "description": "وحدة قياس مستوى الصوت المدرك.",
            "category": "الضوضاء",
            "examples": "- صوت منخفض 20 فون\n- صوت متوسط 50 فون\n- صوت مرتفع 80 فون",
            "Detailed_details": "الفون يقيس الإدراك البشري للصوت. يعادل الديسيبل عند 1000 هرتز. يراعي حساسية الأذن للترددات. مهم في الدراسات الصوتية. يستخدم في تصميم العزل الصوتي."
        },

        "بيكريل": {
            "english": "becquerel",
            "arabic": "بيكريل",
            "description": "وحدة قياس النشاط الإشعاعي.",
            "category": "الإشعاع",
            "examples": "- نشاط منخفض 1000 بيكريل\n- نشاط متوسط 1 ميغابيكريل\n- نشاط مرتفع 1 غيغابيكريل",
            "Detailed_details": "البيكريل يقيس التحللات النووية في الثانية. يرمز له بـ Bq. وحدة النظام الدولي للإشعاع. مهم في الطب النووي. يستخدم في مراقبة التلوث الإشعاعي."
        },

        "سيفرت": {
            "english": "sievert",
            "arabic": "سيفرت",
            "description": "وحدة قياس الجرعة الإشعاعية.",
            "category": "الإشعاع",
            "examples": "- جرعة طبيعية 2.4 ملي سيفرت/سنة\n- تصوير أشعة 0.1 ملي سيفرت\n- جرعة خطرة 1 سيفرت",
            "Detailed_details": "السيفرت يقيس التأثير البيولوجي للإشعاع. يرمز له بـ Sv. مهم في الوقاية الإشعاعية. يستخدم في تحديد حدود التعرض. أساسي في السلامة النووية."
        },



        "ملي_بار": {
            "english": "millibar",
            "arabic": "ملي بار",
            "description": "وحدة قياس الضغط الجوي الشائعة.",
            "category": "الضغط_الجوي",
            "examples": "- منخفض جوي 950 ملي بار\n- ضغط عادي 1013 ملي بار\n- مرتفع جوي 1030 ملي بار",
            "Detailed_details": "الملي بار يساوي 100 باسكال. يرمز له بـ mbar. شائع في النشرات الجوية. مهم في التنبؤ بالطقس. يستخدم في خرائط الطقس."
        },
        "لوكس": {
            "english": "lux",
            "arabic": "لوكس",
            "description": "وحدة قياس شدة الإضاءة.",
            "category": "الإضاءة",
            "examples": "- إضاءة ليلية 10 لوكس\n- إضاءة مكتبية 500 لوكس\n- ضوء الشمس 100000 لوكس",
            "Detailed_details": "اللوكس يساوي لومن/متر². يرمز له بـ lx. يقيس الإضاءة على السطح. مهم في تصميم المباني. يستخدم في معايير السلامة."
        },



        "جزء_بالمليون_كيميائي": {
            "english": "parts_per_million_chemical",
            "arabic": "جزء بالمليون كيميائي",
            "description": "وحدة قياس التراكيز المنخفضة.",
            "category": "التركيز_الكيميائي",
            "examples": "- شوائب 10 جزء بالمليون\n- ملوثات 100 جزء بالمليون\n- مواد سامة 1 جزء بالمليون",
            "Detailed_details": "يقيس التراكيز الضئيلة جداً. يرمز له بـ ppm. يستخدم في تحليل المياه. مهم في قياس الملوثات. أساسي في المعايير البيئية."
        }
    },
    "categories": {
        "الطول": {
            "description": "وحدات قياس المسافات والأطوال",
            "units": ["متر", "كيلومتر", "فرسخ", "ذراع"]
        },
        "الوزن": {
            "description": "وحدات قياس الكتل والأوزان",
            "units": ["كيلوغرام", "رطل", "مثقال"]
        },
        "الحجم": {
            "description": "وحدات قياس السعة والحجوم",
            "units": ["لتر", "صاع"]
        },
        "المساحة": {
            "description": "وحدات قياس المساحات",
            "units": ["متر_مربع", "فدان"]
        },
        "درجة_الحرارة": {
            "description": "وحدات قياس درجات الحرارة",
            "units": ["درجة_مئوية", "درجة_فهرنهايت"]
        },
        "الطاقة": {
            "description": "وحدات قياس الطاقة",
            "units": ["جول", "كيلوجول", "كالوري", "كيلوكالوري", "واط_ساعة", "كيلوواط_ساعة"]
        },
        "القوة": {
            "description": "وحدات قيا القوة",
            "units": ["نيوتن", "دين", "كيلونيوتن"]
        },
        "الضغط": {
            "description": "وحدات قياس الضغط",
            "units": ["باسكال", "بار", "ملي_بار", "ضغط_جوي"]
        },
        "السرعة": {
            "description": "وحدات قياس السرعة",
            "units": ["متر_بالثانية", "كيلومتر_بالساعة", "ميل_بالساعة", "عقدة"]
        },
        "التردد": {
            "description": "وحدات قياس التردد",
            "units": ["هرتز", "كيلوهرتز", "ميغاهرتز", "غيغاهرتز"]
        },
        "التخزين_الرقمي": {
            "description": "وحدات قياس سعة التخزين الرقمي",
            "units": ["بت", "بايت", "كيلوبايت", "ميغابايت", "غيغابايت", "تيرابايت"]
        },
        "الزمن": {
            "description": "وحدات قياس الوقت",
            "units": ["ثانية", "دقيقة", "ساعة", "يوم", "أسبوع", "شهر", "سنة"]
        },
        "الزوايا": {
            "description": "وحدات قياس الزوايا",
            "units": ["درجة", "راديان", "غراد", "دقيقة_قوسية", "ثانية_قوسية"]
        },
        "القدرة": {
            "description": "وحدات قياس القدرة",
            "units": ["واط", "كيلوواط", "ميغاواط", "حصان"]
        },
        "التسارع": {
            "description": "وحدات قياس التسارع",
            "units": ["متر_بالثانية_المربعة", "تسارع_الجاذبية"]
        },
        "الكهرباء": {
            "description": "وحدات القياس الكهربائية",
            "units": ["فولت", "أمبير", "أوم", "فاراد", "هنري"]
        },
        "الإشعاع": {
            "description": "وحدات قياس الإشعاع والنشاط الإشعاعي",
            "units": ["بيكريل", "كوري", "غراي", "سيفرت", "راد", "ريم"]
        },
        "الضوء": {
            "description": "وحدات قياس الضوء والإضاءة",
            "units": ["لومن", "شمعة", "لوكس", "فوت_شمعة", "نيت"]
        },
        "الصوت": {
            "description": "وحدات قياس الصوت",
            "units": ["ديسيبل", "فون", "سون", "باسكال_صوتي"]
        },
        "كيميائية": {
            "description": "وحدات القياس الكيميائية",
            "units": ["مول", "عيارية", "مولارية", "جزء_بالمليون", "جزء_بالمليار"]
        },
        "مغناطيسية": {
            "description": "وحدات القياس المغناطيسية",
            "units": ["تسلا", "غاوس", "ويبر", "أمبير_لفة"]
        },
        "الضغط_الجوي": {
            "description": "وحدات قياس الضغط الجوي",
            "units": ["هيكتوباسكال", "إنش_زئبقي", "مليمتر_زئبقي", "تور"]
        },
        "نقل_البيانات": {
            "description": "وحدات قياس سرعة نقل البيانات",
            "units": ["بت_بالثانية", "كيلوبت_بالثانية", "ميغابت_بالثانية", "غيغابت_بالثانية"]
        },
        "جودة_الهواء": {
            "description": "وحدات قياس جودة الهواء",
            "units": ["ميكروغرام_بالمتر_المكعب", "مؤشر_جودة_الهواء", "جزء_بالمليون_حجمي"]
        },
        "الرطوبة": {
            "description": "وحدات قياس الرطوبة",
            "units": ["نسبة_مئوية_رطوبة", "غرام_بالمتر_المكعب", "نقطة_الندى"]
        },
        "الزلازل": {
            "description": "وحدات قياس الزلازل",
            "units": ["ريختر", "ميركالي", "درجة_زلزالية"]
        },
        "سرعة_الرياح": {
            "description": "وحدات قياس سرعة الرياح",
            "units": ["بوفورت", "عقدة_بحرية", "متر_بالثانية_رياح", "كيلومتر_بالساعة_رياح"]
        },
        "التلوث": {
            "description": "وحدات قياس مستويات التلوث",
            "units": ["مؤشر_جودة_الهواء_عالمي", "ميكروغرام_جسيمات", "مؤشر_تلوث_المياه"]
        },
        "الإشعاع_الشمسي": {
            "description": "وحدات قياس الإشعاع والطاقة الشمسية",
            "units": ["واط_بالمتر_المربع", "لانغلي", "كيلوواط_ساعة_بالمتر_المربع"]
        },
        "المد_والجزر": {
            "description": "وحدات قياس حركة المد والجزر",
            "units": ["متر_مد", "قدم_مد", "معامل_المد"]
        },
        "عمق_المياه": {
            "description": "وحدات قياس أعماق المياه",
            "units": ["فاثوم", "متر_بحري", "قامة"]
        },
        "الطاقة_المتجددة": {
            "description": "وحدات قياس الطاقة المتجددة",
            "units": ["كيلوواط_ذروة", "ميغاواط_ريحي", "جيغاواط_ساعة_متجددة"]
        },
        "استهلاك_الوقود": {
            "description": "وحدات قياس استهلاك الوقود",
            "units": ["لتر_بالمئة_كيلومتر", "ميل_بالغالون", "كيلومتر_باللتر"]
        }
    }
}